/* automatically generated by rust-bindgen 0.68.1 */

pub const EOS_USE_DLLEXPORT: u32 = 1;
pub const _STL_COMPILER_PREPROCESSOR: u32 = 1;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const NULL: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 1;
pub const _STL_WARNING_LEVEL: u32 = 3;
pub const _STL_DISABLED_WARNING_C4984: u32 = 4984;
pub const _STL_DISABLED_WARNING_C5053: u32 = 5053;
pub const _CPPLIB_VER: u32 = 650;
pub const _MSVC_STL_VERSION: u32 = 143;
pub const _MSVC_STL_UPDATE: u32 = 202302;
pub const _HAS_STATIC_RTTI: u32 = 1;
pub const _HAS_STD_BYTE: u32 = 0;
pub const _ENFORCE_MATCHING_ALLOCATORS: u32 = 0;
pub const _ENFORCE_FACET_SPECIALIZATIONS: u32 = 0;
pub const _FACET_SPECIALIZATION_MESSAGE : & [u8 ; 178] = b"Unsupported facet specialization; see N4800 27.3.1.1.1 [locale.category]. Either use a Standard specialization or define _ENFORCE_FACET_SPECIALIZATIONS=0 to suppress this error.\0" ;
pub const _STL_OPTIMIZE_SYSTEM_ERROR_OPERATORS: u32 = 1;
pub const _STD_VECTORIZE_WITH_FLOAT_CONTROL: u32 = 1;
pub const __cpp_lib_chrono_udls: u32 = 201304;
pub const __cpp_lib_complex_udls: u32 = 201309;

    #[doc = " Retrieve an EOS_ProductUserId from a raw string representing an Epic Online Services Product User ID. The input string must be null-terminated.\n NOTE: There is no validation on the string format, this should only be used with values serialized from legitimate sources such as EOS_ProductUserId_ToString\n\n @param ProductUserIdString The stringified product user ID for which to retrieve the Epic Online Services Product User ID\n @return The EOS_ProductUserId that corresponds to the ProductUserIdString"]
    pub fn EOS_ProductUserId_FromString(
        ProductUserIdString: *const ::std::os::raw::c_char,
    ) -> EOS_ProductUserId;
}
#[doc = " Handle to an existing registered notification (0 is an invalid handle)"]
pub type EOS_NotificationId = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_ContinuanceTokenDetails {
    _unused: [u8; 0],
}
#[doc = " A handle to a continuance token @see eos_connect.h"]
pub type EOS_ContinuanceToken = *mut EOS_ContinuanceTokenDetails;
extern "C" {
    #[doc = " Retrieve a null-terminated stringified continuance token from an EOS_ContinuanceToken.\n\n To get the required buffer size, call once with OutBuffer set to NULL, InOutBufferLength will contain the buffer size needed.\n Call again with valid params to get the stringified continuance token which will only contain UTF8-encoded printable characters as well as the null-terminator.\n\n @param ContinuanceToken The continuance token for which to retrieve the stringified version.\n @param OutBuffer The buffer into which the character data should be written\n @param InOutBufferLength The size of the OutBuffer in characters.\n                          The input buffer should include enough space to be null-terminated.\n                          When the function returns, this parameter will be filled with the length of the string copied into OutBuffer including the null-termination character.\n\n @return An EOS_EResult that indicates whether the continuance token string was copied into the OutBuffer.\n         EOS_Success - The OutBuffer was filled, and InOutBufferLength contains the number of characters copied into OutBuffer including the null-terminator.\n         EOS_InvalidParameters - Either OutBuffer or InOutBufferLength were passed as NULL parameters.\n         EOS_InvalidUser - The AccountId is invalid and cannot be stringified.\n         EOS_LimitExceeded - The OutBuffer is not large enough to receive the continuance token string. InOutBufferLength contains the required minimum length to perform the operation successfully."]
    pub fn EOS_ContinuanceToken_ToString(
        ContinuanceToken: EOS_ContinuanceToken,
        OutBuffer: *mut ::std::os::raw::c_char,
        InOutBufferLength: *mut i32,
    ) -> EOS_EResult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_PageQuery {
    #[doc = " API Version: Set this to EOS_PAGEQUERY_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The index into the ordered query results to start the page at."]
    pub StartIndex: i32,
    #[doc = " The maximum number of results to have in the page."]
    pub MaxCount: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_PageQuery() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_PageQuery> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_PageQuery>(),
        12usize,
        concat!("Size of: ", stringify!(_tagEOS_PageQuery))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_PageQuery>(),
        4usize,
        concat!("Alignment of ", stringify!(_tagEOS_PageQuery))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageQuery),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StartIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageQuery),
            "::",
            stringify!(StartIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageQuery),
            "::",
            stringify!(MaxCount)
        )
    );
}
pub type EOS_PageQuery = _tagEOS_PageQuery;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_PageResult {
    #[doc = " The index into the ordered query results to start the page at."]
    pub StartIndex: i32,
    #[doc = " The number of results in the current page."]
    pub Count: i32,
    #[doc = " The number of results associated with they original query options."]
    pub TotalCount: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_PageResult() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_PageResult> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_PageResult>(),
        12usize,
        concat!("Size of: ", stringify!(_tagEOS_PageResult))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_PageResult>(),
        4usize,
        concat!("Alignment of ", stringify!(_tagEOS_PageResult))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StartIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageResult),
            "::",
            stringify!(StartIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageResult),
            "::",
            stringify!(Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TotalCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_PageResult),
            "::",
            stringify!(TotalCount)
        )
    );
}
pub type EOS_PageResult = _tagEOS_PageResult;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_ELoginStatus {
    #[doc = " Player has not logged in or chosen a local profile"]
    EOS_LS_NotLoggedIn = 0,
    #[doc = " Player is using a local profile but is not logged in"]
    EOS_LS_UsingLocalProfile = 1,
    #[doc = " Player has been validated by the platform specific authentication service"]
    EOS_LS_LoggedIn = 2,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EAttributeType {
    #[doc = " Boolean value (true/false)"]
    EOS_AT_BOOLEAN = 0,
    #[doc = " 64 bit integers"]
    EOS_AT_INT64 = 1,
    #[doc = " Double/floating point precision"]
    EOS_AT_DOUBLE = 2,
    #[doc = " UTF8 Strings"]
    EOS_AT_STRING = 3,
}
pub use self::EOS_EAttributeType as EOS_ESessionAttributeType;
pub use self::EOS_EAttributeType as EOS_ELobbyAttributeType;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EComparisonOp {
    #[doc = " Value must equal the one stored on the lobby/session"]
    EOS_CO_EQUAL = 0,
    #[doc = " Value must not equal the one stored on the lobby/session"]
    EOS_CO_NOTEQUAL = 1,
    #[doc = " Value must be strictly greater than the one stored on the lobby/session"]
    EOS_CO_GREATERTHAN = 2,
    #[doc = " Value must be greater than or equal to the one stored on the lobby/session"]
    EOS_CO_GREATERTHANOREQUAL = 3,
    #[doc = " Value must be strictly less than the one stored on the lobby/session"]
    EOS_CO_LESSTHAN = 4,
    #[doc = " Value must be less than or equal to the one stored on the lobby/session"]
    EOS_CO_LESSTHANOREQUAL = 5,
    #[doc = " Prefer values nearest the one specified ie. abs(SearchValue-SessionValue) closest to 0"]
    EOS_CO_DISTANCE = 6,
    #[doc = " Value stored on the lobby/session may be any from a specified list"]
    EOS_CO_ANYOF = 7,
    #[doc = " Value stored on the lobby/session may NOT be any from a specified list"]
    EOS_CO_NOTANYOF = 8,
    #[doc = " This one value is a part of a collection"]
    EOS_CO_ONEOF = 9,
    #[doc = " This one value is NOT part of a collection"]
    EOS_CO_NOTONEOF = 10,
    #[doc = " This value is a CASE SENSITIVE substring of an attribute stored on the lobby/session"]
    EOS_CO_CONTAINS = 11,
}
pub use self::EOS_EComparisonOp as EOS_EOnlineComparisonOp;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EExternalAccountType {
    #[doc = " External account is associated with Epic Games"]
    EOS_EAT_EPIC = 0,
    #[doc = " External account is associated with Steam"]
    EOS_EAT_STEAM = 1,
    #[doc = " External account is associated with PlayStation(TM)Network"]
    EOS_EAT_PSN = 2,
    #[doc = " External account is associated with Xbox Live"]
    EOS_EAT_XBL = 3,
    #[doc = " External account is associated with Discord"]
    EOS_EAT_DISCORD = 4,
    #[doc = " External account is associated with GOG"]
    EOS_EAT_GOG = 5,
    #[doc = " External account is associated with Nintendo\n\n With both EOS Connect and EOS UserInfo APIs, the associated account type is Nintendo Service Account ID.\n Local user authentication is possible using Nintendo Account ID, while the account type does not get exposed to the SDK in queries related to linked accounts information."]
    EOS_EAT_NINTENDO = 6,
    #[doc = " External account is associated with Uplay"]
    EOS_EAT_UPLAY = 7,
    #[doc = " External account is associated with an OpenID Provider"]
    EOS_EAT_OPENID = 8,
    #[doc = " External account is associated with Apple"]
    EOS_EAT_APPLE = 9,
    #[doc = " External account is associated with Google"]
    EOS_EAT_GOOGLE = 10,
    #[doc = " External account is associated with Oculus"]
    EOS_EAT_OCULUS = 11,
    #[doc = " External account is associated with itch.io"]
    EOS_EAT_ITCHIO = 12,
    #[doc = " External account is associated with Amazon"]
    EOS_EAT_AMAZON = 13,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EExternalCredentialType {
    #[doc = " Epic Account Services Token\n\n Using ID Token is preferred, retrieved with EOS_Auth_CopyIdToken that returns EOS_Auth_IdToken::JsonWebToken.\n Using Auth Token is supported for backwards compatibility, retrieved with EOS_Auth_CopyUserAuthToken that returns EOS_Auth_Token::AccessToken.\n\n Supported with EOS_Connect_Login.\n\n @see EOS_Auth_CopyIdToken\n @see EOS_Auth_CopyUserAuthToken"]
    EOS_ECT_EPIC = 0,
    #[doc = " Steam Encrypted App Ticket\n\n Generated using the ISteamUser::RequestEncryptedAppTicket API of Steamworks SDK.\n For ticket generation parameters, use pDataToInclude(NULL) and cbDataToInclude(0).\n\n The retrieved App Ticket byte buffer needs to be converted into a hex-encoded UTF-8 string (e.g. \"FA87097A..\") before passing it to the EOS_Connect_Login API.\n EOS_ByteArray_ToString can be used for this conversion.\n\n Supported with EOS_Connect_Login.\n Note that EOS_ECT_STEAM_APP_TICKET is deprecated for use with EOS_Auth_Login. Use EOS_ECT_STEAM_SESSION_TICKET instead.\n\n @see EOS_ECT_STEAM_SESSION_TICKET"]
    EOS_ECT_STEAM_APP_TICKET = 1,
    #[doc = " PlayStation(TM)Network ID Token\n\n Retrieved from the PlayStation(R) SDK. Please see first-party documentation for additional information.\n\n Supported with EOS_Auth_Login, EOS_Connect_Login."]
    EOS_ECT_PSN_ID_TOKEN = 2,
    #[doc = " Xbox Live XSTS Token\n\n Retrieved from the GDK and XDK. Please see first-party documentation for additional information.\n\n Supported with EOS_Auth_Login, EOS_Connect_Login."]
    EOS_ECT_XBL_XSTS_TOKEN = 3,
    #[doc = " Discord Access Token\n\n Retrieved using the ApplicationManager::GetOAuth2Token API of Discord SDK.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_DISCORD_ACCESS_TOKEN = 4,
    #[doc = " GOG Galaxy Encrypted App Ticket\n\n Generated using the IUser::RequestEncryptedAppTicket API of GOG Galaxy SDK.\n For ticket generation parameters, use data(NULL) and dataSize(0).\n\n The retrieved App Ticket byte buffer needs to be converted into a hex-encoded UTF-8 string (e.g. \"FA87097A..\") before passing it to the EOS_Connect_Login API.\n For C/C++ API integration, use the EOS_ByteArray_ToString API for the conversion.\n For C# integration, you can use <see cref=\"Helper.ToHexString\" /> for the conversion.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_GOG_SESSION_TICKET = 5,
    #[doc = " Nintendo Account ID Token\n\n Identifies a Nintendo user account and is acquired through web flow authentication where the local user logs in using their email address/sign-in ID and password.\n This is the common Nintendo account that users login with outside the Nintendo Switch device.\n\n Supported with EOS_Auth_Login, EOS_Connect_Login."]
    EOS_ECT_NINTENDO_ID_TOKEN = 6,
    #[doc = " Nintendo Service Account ID Token (NSA ID)\n\n The NSA ID identifies uniquely the local Nintendo Switch device. The authentication token is acquired locally without explicit user credentials.\n As such, it is the primary authentication method for seamless login on Nintendo Switch.\n\n The NSA ID is not exposed directly to the user and does not provide any means for login outside the local device.\n Because of this, Nintendo Switch users will need to link their Nintendo Account or another external user account\n to their Product User ID in order to share their game progression across other platforms. Otherwise, the user will\n not be able to login to their existing Product User ID on another platform due to missing login credentials to use.\n It is recommended that the game explicitly communicates this restriction to the user so that they will know to add\n the first linked external account on the Nintendo Switch device and then proceed with login on another platform.\n\n In addition to sharing cross-platform game progression, linking the Nintendo Account or another external account\n will allow preserving the game progression permanently. Otherwise, the game progression will be tied only to the\n local device. In case the user loses access to their local device, they will not be able to recover the game\n progression if it is only associated with this account type.\n\n Supported with EOS_Auth_Login, EOS_Connect_Login."]
    EOS_ECT_NINTENDO_NSA_ID_TOKEN = 7,
    #[doc = " Uplay Access Token"]
    EOS_ECT_UPLAY_ACCESS_TOKEN = 8,
    #[doc = " OpenID Provider Access Token\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_OPENID_ACCESS_TOKEN = 9,
    #[doc = " Device ID access token that identifies the current locally logged in user profile on the local device.\n The local user profile here refers to the operating system user login, for example the user's Windows Account\n or on a mobile device the default active user profile.\n\n This credential type is used to automatically login the local user using the EOS Connect Device ID feature.\n\n The intended use of the Device ID feature is to allow automatically logging in the user on a mobile device\n and to allow playing the game without requiring the user to necessarily login using a real user account at all.\n This makes a seamless first-time experience possible and allows linking the local device with a real external\n user account at a later time, sharing the same EOS_ProductUserId that is being used with the Device ID feature.\n\n Supported with EOS_Connect_Login.\n\n @see EOS_Connect_CreateDeviceId"]
    EOS_ECT_DEVICEID_ACCESS_TOKEN = 10,
    #[doc = " Apple ID Token\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_APPLE_ID_TOKEN = 11,
    #[doc = " Google ID Token\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_GOOGLE_ID_TOKEN = 12,
    #[doc = " Oculus User ID and Nonce\n\n Call ovr_User_GetUserProof(), or Platform.User.GetUserProof() if you are using Unity, to retrieve the nonce.\n Then pass the local User ID and the Nonce as a \"{UserID}|{Nonce}\" formatted string for the EOS_Connect_Login Token parameter.\n\n Note that in order to successfully retrieve a valid non-zero id for the local user using ovr_User_GetUser(),\n your Oculus App needs to be configured in the Oculus Developer Dashboard to have the User ID feature enabled.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_OCULUS_USERID_NONCE = 13,
    #[doc = " itch.io JWT Access Token\n\n Use the itch.io app manifest to receive a JWT access token for the local user via the ITCHIO_API_KEY process environment variable.\n The itch.io access token is valid for 7 days after which the game needs to be restarted by the user as otherwise EOS Connect\n authentication session can no longer be refreshed.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_ITCHIO_JWT = 14,
    #[doc = " itch.io Key Access Token\n\n This access token type is retrieved through the OAuth 2.0 authentication flow for the itch.io application.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_ITCHIO_KEY = 15,
    #[doc = " Epic Games ID Token\n\n Acquired using EOS_Auth_CopyIdToken that returns EOS_Auth_IdToken::JsonWebToken.\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_EPIC_ID_TOKEN = 16,
    #[doc = " Amazon Access Token\n\n Supported with EOS_Connect_Login."]
    EOS_ECT_AMAZON_ACCESS_TOKEN = 17,
    #[doc = " Steam Auth Session Ticket\n\n Generated using the ISteamUser::GetAuthTicketForWebApi API of Steamworks SDK.\n\n @attention\n The pchIdentity input parameter of GetAuthTicketForWebApi API must be set to a valid non-empty string value.\n The string value used by the game client must match identically to the backend-configured value in EOS Dev Portal.\n The recommended value to use is \"epiconlineservices\" in lowercase, matching the default value for new Steam identity provider credentials in EOS Dev Portal.\n This identifier is important for security reasons to prevent session hijacking. Applications must use a dedicated unique identity identifier for Session Tickets passed to the EOS SDK APIs.\n Session Tickets using the EOS-assigned identifier must not be used with anything else than the EOS SDK APIs. You must use a different identifier when generating Session Tickets to authenticate with other parties.\n\n @warning\n To update an already live game to use the new GetAuthTicketForWebApi API instead of the deprecated GetAuthSessionTicket API, follow these steps in this order to prevent breaking the live game for players:\n 1. Update your game client code to use the new ISteamUser::GetAuthTicketForWebApi API.\n 2. Publish the new game client update to end-users.\n 3. Update the existing Steam identity provider credentials entry in EOS Dev Portal to use the same identity string identifier as the game client.\n\n @example\n SteamUser()->GetAuthTicketForWebApi(\"epiconlineservices\");\n\n The retrieved Auth Session Ticket byte buffer needs to be converted into a hex-encoded UTF-8 string (e.g. \"FA87097A..\") before passing it to the EOS_Auth_Login or EOS_Connect_Login APIs.\n EOS_ByteArray_ToString can be used for this conversion.\n\n Supported with EOS_Auth_Login, EOS_Connect_Login.\n\n @version 1.15.1+"]
    EOS_ECT_STEAM_SESSION_TICKET = 18,
}
#[doc = " This type is used to distinguish between different supported integrated platforms.\n Integrated platforms which are common across multiple host platforms will be defined here."]
pub type EOS_IntegratedPlatformType = *const ::std::os::raw::c_char;
#[doc = " This type is used to distinguish between different online platforms."]
pub type EOS_OnlinePlatformType = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_IntegratedPlatformOptionsContainerHandle {
    _unused: [u8; 0],
}
pub type EOS_HIntegratedPlatformOptionsContainer =
    *mut EOS_IntegratedPlatformOptionsContainerHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_IntegratedPlatformHandle {
    _unused: [u8; 0],
}
pub type EOS_HIntegratedPlatform = *mut EOS_IntegratedPlatformHandle;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EIntegratedPlatformManagementFlags {
    #[doc = " The integrated platform library should be disabled. This is equivalent to providing no flags."]
    EOS_IPMF_Disabled = 1,
    #[doc = " The integrated platform library is managed by the calling application. EOS SDK should only hook into an existing instance of the integrated platform library."]
    EOS_IPMF_LibraryManagedByApplication = 2,
    #[doc = " EOS SDK should fully manage the integrated platform library. It will do this by performing the load, initialize, tick and unload operations as necessary."]
    EOS_IPMF_LibraryManagedBySDK = 4,
    #[doc = " The EOS SDK should not mirror the EOS rich presence with the Integrated Platform.\n The default behavior is for EOS SDK to share local presence with the Integrated Platform."]
    EOS_IPMF_DisablePresenceMirroring = 8,
    #[doc = " EOS SDK should not perform any sessions management through the Integrated Platform.\n The default behavior is for EOS SDK to perform sessions management through the Integrated Platform.\n Sessions management includes:\n    - sharing the lobby and session presence enabled games with the Integrated Platform.\n    - handling Social Overlay join button events which cannot be handled by normal processing of Epic Services.\n    - handling Social Overlay invite button events which cannot be handled by normal processing of Epic Services.\n    - handling startup requests from the Integrated Platform to immediately join a game due to in invite while offline.\n\n @see EOS_Lobby_AddNotifySendLobbyNativeInviteRequested"]
    EOS_IPMF_DisableSDKManagedSessions = 16,
    #[doc = " Some features within the EOS SDK may wish to know a preference of Integrated Platform versus EOS.\n When determining an absolute platform preference those with this flag will be skipped.\n The IntegratedPlatforms list is provided via the EOS_Platform_Options during EOS_Platform_Create.\n\n The primary usage of the EOS_IPMF_PreferEOSIdentity and EOS_IPMF_PreferIntegratedIdentity flags is with game invites\n from the Social Overlay.\n\n For game invites from the Social Overlay the EOS SDK will follow these rules:\n     - If the only account ID we can determine for the target player is an EAS ID then the EOS system will be used.\n     - If the only account ID we can determine for the target player is an integrated platform ID then the integrated platform system will be used.\n     - If both are available then the EOS SDK will operate in 1 of 3 modes:\n         - no preference identified: use both the EOS and integrated platform systems.\n         - PreferEOS: Use EOS if the target is an EAS friend and is either online in EAS or not online for the integrated platform.\n         - PreferIntegrated: Use integrated platform if the target is an integrated platform friend and is either online in the integrated platform or not online for EAS.\n     - If the integrated platform fails to send then try EAS if was not already used."]
    EOS_IPMF_PreferEOSIdentity = 32,
    #[doc = " Some features within the EOS SDK may wish to know a preference of Integrated Platform versus EOS.\n For further explanation see EOS_IPMF_PreferEOSIdentity.\n\n @see EOS_IPMF_PreferEOSIdentity"]
    EOS_IPMF_PreferIntegratedIdentity = 64,
    #[doc = " By default the EOS SDK will attempt to detect the login/logout events of local users and update local states accordingly. Setting this flag will disable this functionality,\n relying on the application to process login/logout events and notify EOS SDK. It is not possible for the EOS SDK to do this on all platforms, making this flag not always\n optional.\n\n This flag must be set to use the manual platform user login/logout functions, even on platforms where it is not possible for the EOS SDK to detect login/logout events,\n making this a required flag for correct Integrated Platform behavior on those platforms."]
    EOS_IPMF_ApplicationManagedIdentityLogin = 128,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_Options {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_OPTIONS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The type to be initialized."]
    pub Type: EOS_IntegratedPlatformType,
    #[doc = " Identifies how to initialize the IntegratedPlatform."]
    pub Flags: EOS_EIntegratedPlatformManagementFlags,
    #[doc = " Options specific to this integrated platform type.\n This parameter is either required or set to NULL based on the platform type.\n\n @see EOS_IntegratedPlatform_Steam_Options"]
    pub InitOptions: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_Options() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_IntegratedPlatform_Options> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_Options>(),
        32usize,
        concat!("Size of: ", stringify!(_tagEOS_IntegratedPlatform_Options))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_Options>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_Options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Options),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Options),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Options),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InitOptions) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Options),
            "::",
            stringify!(InitOptions)
        )
    );
}
pub type EOS_IntegratedPlatform_Options = _tagEOS_IntegratedPlatform_Options;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_Steam_Options {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_STEAM_OPTIONS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Usage of this parameter is dependent on the specified EOS_EIntegratedPlatformManagementFlags.\n\n Optional with EOS_IPMF_LibraryManagedByApplication.\n Set to override the loaded library basename, or use NULL to assume the default basename by platform:\n\n - Linux: libsteam_api.so,\n - macOS: libsteam_api.dylib,\n - Windows 32-bit: steam_api.dll,\n - Windows 64-bit: steam_api64.dll.\n\n Required with EOS_IPMF_LibraryManagedBySDK.\n Set to a fully qualified file path to the Steamworks SDK runtime library on disk."]
    pub OverrideLibraryPath: *const ::std::os::raw::c_char,
    #[doc = " Used to specify the major version of the Steam SDK your game is compiled against, e.g.:\n\n Options.SteamMajorVersion = 1;"]
    pub SteamMajorVersion: u32,
    #[doc = " Used to specify the minor version of the Steam SDK your game is compiled against, e.g.:\n\n Options.SteamMinorVersion = 57;"]
    pub SteamMinorVersion: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_Steam_Options() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_IntegratedPlatform_Steam_Options> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_Steam_Options>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_Steam_Options>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideLibraryPath) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options),
            "::",
            stringify!(OverrideLibraryPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SteamMajorVersion) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options),
            "::",
            stringify!(SteamMajorVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SteamMinorVersion) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_Steam_Options),
            "::",
            stringify!(SteamMinorVersion)
        )
    );
}
pub type EOS_IntegratedPlatform_Steam_Options = _tagEOS_IntegratedPlatform_Steam_Options;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_CREATEINTEGRATEDPLATFORMOPTIONSCONTAINER_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions()
{
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<
            _tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions,
        >(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<
            _tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions =
    _tagEOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions;
extern "C" {
    #[doc = " Creates an integrated platform options container handle. This handle can used to add multiple options to your container which will then be applied with EOS_Platform_Create.\n The resulting handle must be released by calling EOS_IntegratedPlatformOptionsContainer_Release once it has been passed to EOS_Platform_Create.\n\n @param Options structure containing operation input parameters.\n @param OutIntegratedPlatformOptionsContainerHandle Pointer to an integrated platform options container handle to be set if successful.\n @return Success if we successfully created the integrated platform options container handle pointed at in OutIntegratedPlatformOptionsContainerHandle, or an error result if the input data was invalid.\n\n @see EOS_IntegratedPlatformOptionsContainer_Release\n @see EOS_Platform_Create\n @see EOS_IntegratedPlatformOptionsContainer_Add"]
    pub fn EOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainer(
        Options: *const EOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainerOptions,
        OutIntegratedPlatformOptionsContainerHandle: *mut EOS_HIntegratedPlatformOptionsContainer,
    ) -> EOS_EResult;
}
extern "C" {
    #[doc = " Release the memory associated with an EOS_HIntegratedPlatformOptionsContainer handle. This must be called on Handles retrieved from EOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainer.\n This can be safely called on a NULL integrated platform options container handle.\n\n @param IntegratedPlatformOptionsContainerHandle The integrated platform options container handle to release.\n\n @see EOS_IntegratedPlatform_CreateIntegratedPlatformOptionsContainer"]
    pub fn EOS_IntegratedPlatformOptionsContainer_Release(
        IntegratedPlatformOptionsContainerHandle: EOS_HIntegratedPlatformOptionsContainer,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatformOptionsContainer_AddOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORMOPTIONSCONTAINER_ADD_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The integrated platform options to add."]
    pub Options: *const EOS_IntegratedPlatform_Options,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatformOptionsContainer_AddOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_IntegratedPlatformOptionsContainer_AddOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatformOptionsContainer_AddOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatformOptionsContainer_AddOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatformOptionsContainer_AddOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatformOptionsContainer_AddOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatformOptionsContainer_AddOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Options) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatformOptionsContainer_AddOptions),
            "::",
            stringify!(Options)
        )
    );
}
pub type EOS_IntegratedPlatformOptionsContainer_AddOptions =
    _tagEOS_IntegratedPlatformOptionsContainer_AddOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_SetUserLoginStatusOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_SETUSERLOGINSTATUS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The integrated platform this user belongs to."]
    pub PlatformType: EOS_IntegratedPlatformType,
    #[doc = " String version of the integrated platform-dependent user id."]
    pub LocalPlatformUserId: *const ::std::os::raw::c_char,
    #[doc = " The login status of the provided user"]
    pub CurrentLoginStatus: EOS_ELoginStatus,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_SetUserLoginStatusOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlatformType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions),
            "::",
            stringify!(PlatformType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalPlatformUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions),
            "::",
            stringify!(LocalPlatformUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentLoginStatus) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserLoginStatusOptions),
            "::",
            stringify!(CurrentLoginStatus)
        )
    );
}
pub type EOS_IntegratedPlatform_SetUserLoginStatusOptions =
    _tagEOS_IntegratedPlatform_SetUserLoginStatusOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_ADDNOTIFYUSERLOGINSTATUSCHANGED_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions() {
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions =
    _tagEOS_IntegratedPlatform_AddNotifyUserLoginStatusChangedOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo {
    #[doc = " Context that was passed into EOS_IntegratedPlatform_AddNotifyUserLoginStatusChanged"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The integrated platform of the local platform user."]
    pub PlatformType: EOS_IntegratedPlatformType,
    #[doc = " String version of platform's user id."]
    pub LocalPlatformUserId: *const ::std::os::raw::c_char,
    #[doc = " The Epic Games Account ID associated with this Integrated Platform's User (if there is one)"]
    pub AccountId: EOS_EpicAccountId,
    #[doc = " The EOS Product User ID associated with this Integrated Platform's User (if there is one)"]
    pub ProductUserId: EOS_ProductUserId,
    #[doc = " The login status prior to this change."]
    pub PreviousLoginStatus: EOS_ELoginStatus,
    #[doc = " The login status at the time of this notification."]
    pub CurrentLoginStatus: EOS_ELoginStatus,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlatformType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(PlatformType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalPlatformUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(LocalPlatformUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(AccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductUserId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(ProductUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousLoginStatus) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(PreviousLoginStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentLoginStatus) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
            "::",
            stringify!(CurrentLoginStatus)
        )
    );
}
pub type EOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo =
    _tagEOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo;
pub type EOS_IntegratedPlatform_OnUserLoginStatusChangedCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_IntegratedPlatform_UserLoginStatusChangedCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_SETUSERPRELOGOUTCALLBACK_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions() {
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions =
    _tagEOS_IntegratedPlatform_SetUserPreLogoutCallbackOptions;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EIntegratedPlatformPreLogoutAction {
    #[doc = " The application accepts the user being logged-out. all cached data for the user will be cleared immediately and any pending\n actions canceled."]
    EOS_IPLA_ProcessLogoutImmediately = 0,
    #[doc = " Instead of the user being logged-out, the SDK will wait for a call to EOS_IntegratedPlatform_FinalizeDeferredUserLogout with the\n expected login state of the user. If the expected state matches the current state, the user will continue to be logged-in or they\n will be logged-out, depending on the value of the expected state. This lets the application choose to ask the user if they meant\n to logout if it wishes, possibly preventing losing any unsaved changes, such as game progress, leaving a multiplayer match, or\n similar.\n\n @see EOS_IntegratedPlatform_FinalizeDeferredUserLogout"]
    EOS_IPLA_DeferLogout = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo {
    #[doc = " Context that was passed into EOS_IntegratedPlatform_SetUserPreLogoutCallback"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The integrated platform the local user logged-out of."]
    pub PlatformType: EOS_IntegratedPlatformType,
    #[doc = " String version of platform-dependent user id."]
    pub LocalPlatformUserId: *const ::std::os::raw::c_char,
    #[doc = " The Epic Games Account ID associated with this Integrated Platform's User (if there is one)"]
    pub AccountId: EOS_EpicAccountId,
    #[doc = " The EOS Product User ID associated with this Integrated Platform's User (if there is one)"]
    pub ProductUserId: EOS_ProductUserId,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlatformType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo),
            "::",
            stringify!(PlatformType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalPlatformUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo),
            "::",
            stringify!(LocalPlatformUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo),
            "::",
            stringify!(AccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductUserId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo),
            "::",
            stringify!(ProductUserId)
        )
    );
}
pub type EOS_IntegratedPlatform_UserPreLogoutCallbackInfo =
    _tagEOS_IntegratedPlatform_UserPreLogoutCallbackInfo;
pub type EOS_IntegratedPlatform_OnUserPreLogoutCallback = ::std::option::Option<
    unsafe extern "C" fn(
        Data: *const EOS_IntegratedPlatform_UserPreLogoutCallbackInfo,
    ) -> EOS_EIntegratedPlatformPreLogoutAction,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_CLEARUSERPRELOGOUTCALLBACK_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions() {
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions =
    _tagEOS_IntegratedPlatform_ClearUserPreLogoutCallbackOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions {
    #[doc = " API Version: Set this to EOS_INTEGRATEDPLATFORM_FINALIZEDEFERREDUSERLOGOUT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The integrated platform this user belongs to."]
    pub PlatformType: EOS_IntegratedPlatformType,
    #[doc = " String version of the integrated platform-dependent user id."]
    pub LocalPlatformUserId: *const ::std::os::raw::c_char,
    #[doc = " The logged-in state the user is expected to be (EOS_LS_LoggedIn or EOS_LS_NotLoggedIn). If the provided\n state does not match internal EOS state, this function will return in failure. If the state is incorrect,\n the application should wait and attempt to call the function again next tick, after both updating its own\n state from the system and calling EOS_Platform_Tick, allowing the SDK to update its state from the system\n as well."]
    pub ExpectedLoginStatus: EOS_ELoginStatus,
}
#[test]
fn bindgen_test_layout__tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions() {
    const UNINIT: ::std::mem::MaybeUninit<
        _tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlatformType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions),
            "::",
            stringify!(PlatformType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalPlatformUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions),
            "::",
            stringify!(LocalPlatformUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpectedLoginStatus) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions),
            "::",
            stringify!(ExpectedLoginStatus)
        )
    );
}
pub type EOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions =
    _tagEOS_IntegratedPlatform_FinalizeDeferredUserLogoutOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_PlatformHandle {
    _unused: [u8; 0],
}
pub type EOS_HPlatform = *mut EOS_PlatformHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Platform_ClientCredentials {
    #[doc = " Client ID of the service permissions entry. Set to NULL if no service permissions are used. Max length is EOS_PLATFORM_CLIENTCREDENTIALS_CLIENTID_MAX_LENGTH."]
    pub ClientId: *const ::std::os::raw::c_char,
    #[doc = " Client secret for accessing the set of permissions. Set to NULL if no service permissions are used. Max length is EOS_PLATFORM_CLIENTCREDENTIALS_CLIENTSECRET_MAX_LENGTH."]
    pub ClientSecret: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Platform_ClientCredentials() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Platform_ClientCredentials> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Platform_ClientCredentials>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Platform_ClientCredentials))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Platform_ClientCredentials>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Platform_ClientCredentials)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_ClientCredentials),
            "::",
            stringify!(ClientId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientSecret) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_ClientCredentials),
            "::",
            stringify!(ClientSecret)
        )
    );
}
pub type EOS_Platform_ClientCredentials = _tagEOS_Platform_ClientCredentials;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_ERTCBackgroundMode {
    #[doc = " Upon entering a background application status, all logged in users leave any RTC rooms. All subsequent attemps to join any RTC rooms will be rejected.\n Upon returning to a foreground application status, all subsequent attemps to join any RTC rooms will be allowed."]
    EOS_RTCBM_LeaveRooms = 0,
    #[doc = " Application status has no effect on RTC rooms. Audio is captured from input devices and is played to output devices.\n Games should obtain consent from users and otherwise make users aware this is occurring."]
    EOS_RTCBM_KeepRoomsAlive = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Platform_RTCOptions {
    #[doc = " API Version: Set this to EOS_PLATFORM_RTCOPTIONS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " This field is for platform specific initialization if any.\n\n If provided then the structure will be located in <System>/eos_<System>.h.\n The structure will be named EOS_<System>_RTCOptions."]
    pub PlatformSpecificOptions: *mut ::std::os::raw::c_void,
    #[doc = " Configures RTC behavior upon entering to any background application statuses"]
    pub BackgroundMode: EOS_ERTCBackgroundMode,
}
#[test]
fn bindgen_test_layout__tagEOS_Platform_RTCOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Platform_RTCOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Platform_RTCOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Platform_RTCOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Platform_RTCOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Platform_RTCOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_RTCOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlatformSpecificOptions) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_RTCOptions),
            "::",
            stringify!(PlatformSpecificOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BackgroundMode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_RTCOptions),
            "::",
            stringify!(BackgroundMode)
        )
    );
}
pub type EOS_Platform_RTCOptions = _tagEOS_Platform_RTCOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Platform_Options {
    #[doc = " API Version: Set this to EOS_PLATFORM_OPTIONS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " A reserved field that should always be nulled."]
    pub Reserved: *mut ::std::os::raw::c_void,
    #[doc = " The product ID for the running application, found on the dev portal. Max length is EOS_PLATFORM_OPTIONS_PRODUCTID_MAX_LENGTH."]
    pub ProductId: *const ::std::os::raw::c_char,
    #[doc = " The sandbox ID for the running application, found on the dev portal. Max length is EOS_PLATFORM_OPTIONS_SANDBOXID_MAX_LENGTH."]
    pub SandboxId: *const ::std::os::raw::c_char,
    #[doc = " Set of service permissions associated with the running application"]
    pub ClientCredentials: EOS_Platform_ClientCredentials,
    #[doc = " Set this to EOS_FALSE if the application is running as a client with a local user, otherwise set to EOS_TRUE (e.g. for a dedicated game server)"]
    pub bIsServer: EOS_Bool,
    #[doc = " Used by Player Data Storage and Title Storage. Must be null initialized if unused. 256-bit Encryption Key for file encryption in hexadecimal format; EOS_PLATFORM_OPTIONS_ENCRYPTIONKEY_LENGTH hex chars."]
    pub EncryptionKey: *const ::std::os::raw::c_char,
    #[doc = " The override country code to use for the logged in user. (EOS_COUNTRYCODE_MAX_LENGTH)"]
    pub OverrideCountryCode: *const ::std::os::raw::c_char,
    #[doc = " The override locale code to use for the logged in user. This follows ISO 639. (EOS_LOCALECODE_MAX_LENGTH)"]
    pub OverrideLocaleCode: *const ::std::os::raw::c_char,
    #[doc = " The deployment ID for the running application, found on the dev portal. Max length is EOS_PLATFORM_OPTIONS_DEPLOYMENTID_MAX_LENGTH."]
    pub DeploymentId: *const ::std::os::raw::c_char,
    #[doc = " Platform creation flags, e.g. EOS_PF_LOADING_IN_EDITOR. This is a bitwise-or union of the defined flags."]
    pub Flags: u64,
    #[doc = " Used by Player Data Storage and Title Storage. Must be null initialized if unused. Cache directory path. Absolute path to the folder that is going to be used for caching temporary data. The path is created if it's missing."]
    pub CacheDirectory: *const ::std::os::raw::c_char,
    #[doc = " A budget, measured in milliseconds, for EOS_Platform_Tick to do its work. When the budget is met or exceeded (or if no work is available), EOS_Platform_Tick will return.\n This allows your game to amortize the cost of SDK work across multiple frames in the event that a lot of work is queued for processing.\n Zero is interpreted as \"perform all available work\"."]
    pub TickBudgetInMilliseconds: u32,
    #[doc = " RTC options. Setting to NULL will disable RTC features (e.g. voice)"]
    pub RTCOptions: *const EOS_Platform_RTCOptions,
    #[doc = " A handle that contains all the options for setting up integrated platforms.\n When set to NULL, the EOS Integrated Platform behavior for the host platform will be disabled."]
    pub IntegratedPlatformOptionsContainerHandle: EOS_HIntegratedPlatformOptionsContainer,
    #[doc = " Pointer to EOS_<Platform>_SystemSpecificOptions. This structure will be located in <Platform>/eos_<Platform>.h"]
    pub SystemSpecificOptions: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__tagEOS_Platform_Options() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Platform_Options> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Platform_Options>(),
        136usize,
        concat!("Size of: ", stringify!(_tagEOS_Platform_Options))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Platform_Options>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Platform_Options))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(Reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(ProductId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(SandboxId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientCredentials) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(ClientCredentials)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIsServer) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(bIsServer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EncryptionKey) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(EncryptionKey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideCountryCode) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(OverrideCountryCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideLocaleCode) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(OverrideLocaleCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeploymentId) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(DeploymentId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CacheDirectory) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(CacheDirectory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TickBudgetInMilliseconds) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(TickBudgetInMilliseconds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RTCOptions) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(RTCOptions)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IntegratedPlatformOptionsContainerHandle) as usize
                - ptr as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(IntegratedPlatformOptionsContainerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemSpecificOptions) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_Options),
            "::",
            stringify!(SystemSpecificOptions)
        )
    );
}
pub type EOS_Platform_Options = _tagEOS_Platform_Options;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EApplicationStatus {
    #[doc = " Xbox only.\n\n Notifies the SDK that the application has entered constrained mode.\n While in constrained mode, the application has reduced access to reserved system resources."]
    EOS_AS_BackgroundConstrained = 0,
    #[doc = " Xbox only.\n\n Notifies the SDK that the application has returned from constrained mode,\n and is back to running in a regular state with full access to system resources.\n\n The SDK will handle this state change and automatically transition its active state to EOS_AS_Foreground.\n As result, after the application has set the EOS_AS_BackgroundUnconstrained state,\n calling EOS_Platform_GetApplicationStatus will return EOS_AS_Foreground as the persisted active state."]
    EOS_AS_BackgroundUnconstrained = 1,
    #[doc = " Notifies the SDK that the application has been put into suspended state by the platform system."]
    EOS_AS_BackgroundSuspended = 2,
    #[doc = " Notifies the SDK that the application has been resumed from suspended state.\n\n This is the default active state on all platforms."]
    EOS_AS_Foreground = 3,
}
extern "C" {
    #[doc = " Gets the string representation of an EOS_EApplicationStatus value.\n\n Example: EOS_EApplicationStatus_ToString(EOS_EApplicationStatus::EOS_AS_Foreground) returns \"EOS_AS_Foreground\".\n\n @param ApplicationStatus EOS_EApplicationStatus value to get as string.\n\n @return Pointer to a static string representing the input enum value.\n         The returned string is guaranteed to be non-null, and must not be freed by the application."]
    pub fn EOS_EApplicationStatus_ToString(
        ApplicationStatus: EOS_EApplicationStatus,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_ENetworkStatus {
    #[doc = " Networking unavailable."]
    EOS_NS_Disabled = 0,
    #[doc = " Not connected to the internet. Only local area networking (LAN) may be available."]
    EOS_NS_Offline = 1,
    #[doc = " Connected to the internet."]
    EOS_NS_Online = 2,
}
extern "C" {
    #[doc = " Gets the string representation of an EOS_ENetworkStatus value.\n\n Example: EOS_ENetworkStatus_ToString(EOS_ENetworkStatus::EOS_NS_Online) returns \"EOS_NS_Online\".\n\n @param NetworkStatus EOS_ENetworkStatus value to get as string.\n\n @return Pointer to a static string representing the input enum value.\n         The returned string is guaranteed to be non-null, and must not be freed by the application."]
    pub fn EOS_ENetworkStatus_ToString(
        NetworkStatus: EOS_ENetworkStatus,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EDesktopCrossplayStatus {
    #[doc = " Desktop crossplay is ready to use."]
    EOS_DCS_OK = 0,
    #[doc = " The application was not launched through the Bootstrapper."]
    EOS_DCS_ApplicationNotBootstrapped = 1,
    #[doc = " The redistributable service is not installed."]
    EOS_DCS_ServiceNotInstalled = 2,
    #[doc = " The service failed to start."]
    EOS_DCS_ServiceStartFailed = 3,
    #[doc = " The service was started successfully, but is no longer running in the background, for an unknown reason."]
    EOS_DCS_ServiceNotRunning = 4,
    #[doc = " The application has explicitly disabled the overlay through SDK initialization flags."]
    EOS_DCS_OverlayDisabled = 5,
    #[doc = " The overlay is not installed.\n\n As the overlay is automatically installed and kept up-to-date by the redistributable service,\n this indicates that the user may have separately manually removed the installed overlay files."]
    EOS_DCS_OverlayNotInstalled = 6,
    #[doc = " The overlay was not loaded due to failing trust check on the digital signature of the file on disk.\n\n This error typically indicates one of the following root causes:\n - The Operating System's local certificate store is out of date.\n - The local system clock has skewed and is in the wrong time.\n - The file has been tampered with.\n - The file trust check timed out, either due to an issue with the local system or network connectivity.\n\n The first troubleshooting steps should be to check for any available Operating System updates,\n for example using the Windows Update, as well as verifying that the system time is correctly set."]
    EOS_DCS_OverlayTrustCheckFailed = 7,
    #[doc = " The overlay failed to load."]
    EOS_DCS_OverlayLoadFailed = 8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Platform_GetDesktopCrossplayStatusOptions {
    #[doc = " API Version: Set this to EOS_PLATFORM_GETDESKTOPCROSSPLAYSTATUS_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_Platform_GetDesktopCrossplayStatusOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Platform_GetDesktopCrossplayStatusOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Platform_GetDesktopCrossplayStatusOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Platform_GetDesktopCrossplayStatusOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Platform_GetDesktopCrossplayStatusOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Platform_GetDesktopCrossplayStatusOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_GetDesktopCrossplayStatusOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_Platform_GetDesktopCrossplayStatusOptions =
    _tagEOS_Platform_GetDesktopCrossplayStatusOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Platform_DesktopCrossplayStatusInfo {
    #[doc = " Status for the availability of desktop crossplay functionality.\n\n It is recommended to include this value in application logs, and as part of\n any player-facing error screens to help troubleshooting possible issues."]
    pub Status: EOS_EDesktopCrossplayStatus,
    #[doc = " This field is set when the Status is EOS_DCS_ServiceStartFailed.\n\n Possible values for this field are not documented. However, it is recommended\n to be also included in application logs, and as part of any player-facing\n error screens."]
    pub ServiceInitResult: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_Platform_DesktopCrossplayStatusInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Platform_DesktopCrossplayStatusInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Platform_DesktopCrossplayStatusInfo>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Platform_DesktopCrossplayStatusInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Platform_DesktopCrossplayStatusInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Platform_DesktopCrossplayStatusInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_DesktopCrossplayStatusInfo),
            "::",
            stringify!(Status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ServiceInitResult) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Platform_DesktopCrossplayStatusInfo),
            "::",
            stringify!(ServiceInitResult)
        )
    );
}
pub type EOS_Platform_DesktopCrossplayStatusInfo = _tagEOS_Platform_DesktopCrossplayStatusInfo;
#[doc = " Function prototype type definition for functions that allocate memory.\n\n Functions passed to EOS_Initialize to serve as memory allocators should return a pointer to the allocated memory.\n\n The returned pointer should have at least SizeInBytes available capacity and the memory address should be a multiple of Alignment.\n The SDK will always call the provided function with an Alignment that is a power of 2.\n Allocation failures should return a null pointer."]
pub type EOS_AllocateMemoryFunc = ::std::option::Option<
    unsafe extern "C" fn(SizeInBytes: usize, Alignment: usize) -> *mut ::std::os::raw::c_void,
>;
#[doc = " Function prototype type definition for functions that reallocate memory.\n\n Functions passed to EOS_Initialize to serve as memory reallocators should return a pointer to the reallocated memory.\n The returned pointer should have at least SizeInBytes available capacity and the memory address should be a multiple of alignment.\n The SDK will always call the provided function with an Alignment that is a power of 2.\n Reallocation failures should return a null pointer."]
pub type EOS_ReallocateMemoryFunc = ::std::option::Option<
    unsafe extern "C" fn(
        Pointer: *mut ::std::os::raw::c_void,
        SizeInBytes: usize,
        Alignment: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " Function prototype type definition for functions that release memory.\n\n When the SDK is done with memory that has been allocated by a custom allocator passed to EOS_Initialize, it will call the corresponding memory release function."]
pub type EOS_ReleaseMemoryFunc =
    ::std::option::Option<unsafe extern "C" fn(Pointer: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Initialize_ThreadAffinity {
    #[doc = " API Version: Set this to EOS_INITIALIZE_THREADAFFINITY_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Any thread related to network management that is not IO."]
    pub NetworkWork: u64,
    #[doc = " Any thread that will interact with a storage device."]
    pub StorageIo: u64,
    #[doc = " Any thread that will generate web socket IO."]
    pub WebSocketIo: u64,
    #[doc = " Any thread that will generate IO related to P2P traffic and management."]
    pub P2PIo: u64,
    #[doc = " Any thread that will generate http request IO."]
    pub HttpRequestIo: u64,
    #[doc = " Any thread that will generate IO related to RTC traffic and management."]
    pub RTCIo: u64,
}
#[test]
fn bindgen_test_layout__tagEOS_Initialize_ThreadAffinity() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Initialize_ThreadAffinity> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Initialize_ThreadAffinity>(),
        56usize,
        concat!("Size of: ", stringify!(_tagEOS_Initialize_ThreadAffinity))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Initialize_ThreadAffinity>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Initialize_ThreadAffinity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NetworkWork) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(NetworkWork)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StorageIo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(StorageIo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WebSocketIo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(WebSocketIo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).P2PIo) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(P2PIo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HttpRequestIo) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(HttpRequestIo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RTCIo) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Initialize_ThreadAffinity),
            "::",
            stringify!(RTCIo)
        )
    );
}
pub type EOS_Initialize_ThreadAffinity = _tagEOS_Initialize_ThreadAffinity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_InitializeOptions {
    #[doc = " API Version: Set this to EOS_INITIALIZE_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " A custom memory allocator, if desired."]
    pub AllocateMemoryFunction: EOS_AllocateMemoryFunc,
    #[doc = " A corresponding memory reallocator. If the AllocateMemoryFunction is nulled, then this field must also be nulled."]
    pub ReallocateMemoryFunction: EOS_ReallocateMemoryFunc,
    #[doc = " A corresponding memory releaser. If the AllocateMemoryFunction is nulled, then this field must also be nulled."]
    pub ReleaseMemoryFunction: EOS_ReleaseMemoryFunc,
    #[doc = " The name of the product using the Epic Online Services SDK.\n\n The name string is required to be non-empty and at maximum of EOS_INITIALIZEOPTIONS_PRODUCTNAME_MAX_LENGTH bytes long.\n The string buffer can consist of the following characters:\n A-Z, a-z, 0-9, dot, underscore, space, exclamation mark, question mark, and sign, hyphen, parenthesis, plus, minus, colon."]
    pub ProductName: *const ::std::os::raw::c_char,
    #[doc = " Product version of the running application.\n\n The version string is required to be non-empty and at maximum of EOS_INITIALIZEOPTIONS_PRODUCTVERSION_MAX_LENGTH bytes long.\n The string buffer can consist of the following characters:\n A-Z, a-z, 0-9, dot, underscore, space, exclamation mark, question mark, and sign, hyphen, parenthesis, plus, minus, colon."]
    pub ProductVersion: *const ::std::os::raw::c_char,
    #[doc = " A reserved field that should always be nulled."]
    pub Reserved: *mut ::std::os::raw::c_void,
    #[doc = " This field is for system specific initialization if any.\n\n If provided then the structure will be located in <System>/eos_<system>.h.\n The structure will be named EOS_<System>_InitializeOptions."]
    pub SystemInitializeOptions: *mut ::std::os::raw::c_void,
    #[doc = " The thread affinity override values for each category of thread."]
    pub OverrideThreadAffinity: *mut EOS_Initialize_ThreadAffinity,
}
#[test]
fn bindgen_test_layout__tagEOS_InitializeOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_InitializeOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_InitializeOptions>(),
        72usize,
        concat!("Size of: ", stringify!(_tagEOS_InitializeOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_InitializeOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_InitializeOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AllocateMemoryFunction) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(AllocateMemoryFunction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReallocateMemoryFunction) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(ReallocateMemoryFunction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseMemoryFunction) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(ReleaseMemoryFunction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductName) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(ProductName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductVersion) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(ProductVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(Reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemInitializeOptions) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(SystemInitializeOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideThreadAffinity) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_InitializeOptions),
            "::",
            stringify!(OverrideThreadAffinity)
        )
    );
}
pub type EOS_InitializeOptions = _tagEOS_InitializeOptions;
extern "C" {
    #[doc = " Initialize the Epic Online Services SDK.\n\n Before calling any other function in the SDK, clients must call this function.\n\n This function must only be called one time and must have a corresponding EOS_Shutdown call.\n\n @param Options - The initialization options to use for the SDK.\n @return An EOS_EResult is returned to indicate success or an error.\n\n EOS_Success is returned if the SDK successfully initializes.\n EOS_AlreadyConfigured is returned if the function has already been called.\n EOS_InvalidParameters is returned if the provided options are invalid."]
    pub fn EOS_Initialize(Options: *const EOS_InitializeOptions) -> EOS_EResult;
}
extern "C" {
    #[doc = " Tear down the Epic Online Services SDK.\n\n Once this function has been called, no more SDK calls are permitted; calling anything after EOS_Shutdown will result in undefined behavior.\n @return An EOS_EResult is returned to indicate success or an error.\n EOS_Success is returned if the SDK is successfully torn down.\n EOS_NotConfigured is returned if a successful call to EOS_Initialize has not been made.\n EOS_UnexpectedError is returned if EOS_Shutdown has already been called."]
    pub fn EOS_Shutdown() -> EOS_EResult;
}
extern "C" {
    #[doc = " Create a single Epic Online Services Platform Instance.\n\n The platform instance is used to gain access to the various Epic Online Services.\n\n This function returns an opaque handle to the platform instance, and that handle must be passed to EOS_Platform_Release to release the instance.\n\n @return An opaque handle to the platform instance."]
    pub fn EOS_Platform_Create(Options: *const EOS_Platform_Options) -> EOS_HPlatform;
}
extern "C" {
    #[doc = " Release an Epic Online Services platform instance previously returned from EOS_Platform_Create.\n\n This function should only be called once per instance returned by EOS_Platform_Create. Undefined behavior will result in calling it with a single instance more than once.\n Typically only a single platform instance needs to be created during the lifetime of a game.\n You should release each platform instance before calling the EOS_Shutdown function."]
    pub fn EOS_Platform_Release(Handle: EOS_HPlatform);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_MetricsHandle {
    _unused: [u8; 0],
}
pub type EOS_HMetrics = *mut EOS_MetricsHandle;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EUserControllerType {
    #[doc = " The game controller type is unknown."]
    EOS_UCT_Unknown = 0,
    #[doc = " Mouse and keyboard controller."]
    EOS_UCT_MouseKeyboard = 1,
    #[doc = " Gamepad controller."]
    EOS_UCT_GamepadControl = 2,
    #[doc = " Touch controller."]
    EOS_UCT_TouchControl = 3,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EMetricsAccountIdType {
    #[doc = " An Epic Account ID."]
    EOS_MAIT_Epic = 0,
    #[doc = " An external service Account ID."]
    EOS_MAIT_External = 1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _tagEOS_Metrics_BeginPlayerSessionOptions {
    #[doc = " API Version: Set this to EOS_METRICS_BEGINPLAYERSESSION_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Account ID type that is set in the union."]
    pub AccountIdType: EOS_EMetricsAccountIdType,
    #[doc = " The Account ID for the player whose session is beginning."]
    pub AccountId: _tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1,
    #[doc = " The in-game display name for the user as UTF-8 string."]
    pub DisplayName: *const ::std::os::raw::c_char,
    #[doc = " The user's game controller type."]
    pub ControllerType: EOS_EUserControllerType,
    #[doc = " IP address of the game server hosting the game session. For a localhost session, set to NULL.\n\n @details Must be in either one of the following IPv4 or IPv6 string formats:\n * \"127.0.0.1\".\n * \"1200:0000:AB00:1234:0000:2552:7777:1313\".\n If both IPv4 and IPv6 addresses are available, use the IPv6 address."]
    pub ServerIp: *const ::std::os::raw::c_char,
    #[doc = " Optional, application-defined custom match session identifier. If the identifier is not used, set to NULL.\n\n @details The game can tag each game session with a custom session match identifier,\n which will be shown in the Played Sessions listing at the user profile dashboard."]
    pub GameSessionId: *const ::std::os::raw::c_char,
}
#[doc = " The Account ID for the player whose session is beginning."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1 {
    #[doc = " An Epic Account ID. Set this field when AccountIdType is set to EOS_MAIT_Epic."]
    pub Epic: EOS_EpicAccountId,
    #[doc = " An Account ID for another service. Set this field when AccountIdType is set to EOS_MAIT_External."]
    pub External: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Epic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1),
            "::",
            stringify!(Epic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).External) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions__bindgen_ty_1),
            "::",
            stringify!(External)
        )
    );
}
#[test]
fn bindgen_test_layout__tagEOS_Metrics_BeginPlayerSessionOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Metrics_BeginPlayerSessionOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Metrics_BeginPlayerSessionOptions>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Metrics_BeginPlayerSessionOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountIdType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(AccountIdType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(AccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisplayName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(DisplayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ControllerType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(ControllerType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ServerIp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(ServerIp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GameSessionId) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_BeginPlayerSessionOptions),
            "::",
            stringify!(GameSessionId)
        )
    );
}
pub type EOS_Metrics_BeginPlayerSessionOptions = _tagEOS_Metrics_BeginPlayerSessionOptions;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _tagEOS_Metrics_EndPlayerSessionOptions {
    #[doc = " API Version: Set this to EOS_METRICS_ENDPLAYERSESSION_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Account ID type that is set in the union."]
    pub AccountIdType: EOS_EMetricsAccountIdType,
    #[doc = " The Account ID for the player whose session is ending."]
    pub AccountId: _tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1,
}
#[doc = " The Account ID for the player whose session is ending."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1 {
    #[doc = " An Epic Account ID. Set this field when AccountIdType is set to EOS_MAIT_Epic."]
    pub Epic: EOS_EpicAccountId,
    #[doc = " An Account ID for another service. Set this field when AccountIdType is set to EOS_MAIT_External."]
    pub External: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Epic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1),
            "::",
            stringify!(Epic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).External) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions__bindgen_ty_1),
            "::",
            stringify!(External)
        )
    );
}
#[test]
fn bindgen_test_layout__tagEOS_Metrics_EndPlayerSessionOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Metrics_EndPlayerSessionOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Metrics_EndPlayerSessionOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Metrics_EndPlayerSessionOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountIdType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions),
            "::",
            stringify!(AccountIdType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Metrics_EndPlayerSessionOptions),
            "::",
            stringify!(AccountId)
        )
    );
}
pub type EOS_Metrics_EndPlayerSessionOptions = _tagEOS_Metrics_EndPlayerSessionOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_AccountFeatureRestrictedInfo {
    #[doc = " API Version: Set this to EOS_AUTH_ACCOUNTFEATURERESTRICTEDINFO_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The end-user verification URI. Users must be asked to open the page in a browser to address the restrictions."]
    pub VerificationURI: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_AccountFeatureRestrictedInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_AccountFeatureRestrictedInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_AccountFeatureRestrictedInfo>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_AccountFeatureRestrictedInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_AccountFeatureRestrictedInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_AccountFeatureRestrictedInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_AccountFeatureRestrictedInfo),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VerificationURI) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_AccountFeatureRestrictedInfo),
            "::",
            stringify!(VerificationURI)
        )
    );
}
pub type EOS_Auth_AccountFeatureRestrictedInfo = _tagEOS_Auth_AccountFeatureRestrictedInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_AuthHandle {
    _unused: [u8; 0],
}
pub type EOS_HAuth = *mut EOS_AuthHandle;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_ELoginCredentialType {
    #[doc = " Login using account email address and password.\n\n @note Use of this login method is restricted and cannot be used in general."]
    EOS_LCT_Password = 0,
    #[doc = " A short-lived one-time use exchange code to login the local user.\n\n @details Typically retrieved via command-line parameters provided by a launcher that generated the exchange code for this application.\n When started, the application is expected to consume the exchange code by using the EOS_Auth_Login API as soon as possible.\n This is needed in order to authenticate the local user before the exchange code would expire.\n Attempting to consume an already expired exchange code will return EOS_EResult::EOS_Auth_ExchangeCodeNotFound error by the EOS_Auth_Login API."]
    EOS_LCT_ExchangeCode = 1,
    #[doc = " Used by standalone applications distributed outside the supported game platforms such as Epic Games Store or Steam, and on Nintendo Switch.\n\n Persistent Auth is used in conjuction with the EOS_LCT_AccountPortal login method for automatic login of the local user across multiple runs of the application.\n\n Standalone applications implement the login sequence as follows:\n 1. Application calls EOS_Auth_Login with EOS_LCT_PersistentAuth, using a previously stored Epic refresh token for an automatic user login.\n 2. If automatic login fails, the application discards the Epic refresh token used as defunct, and proceeds to call EOS_Auth_Login with EOS_LCT_AccountPortal to prompt the user for manual login.\n\n @note On Desktop and Mobile platforms, the persistent refresh token is automatically managed by the SDK that stores it in the keychain of the currently logged in user of the local device.\n On Nintendo Switch, after a successful login the refresh token must be retrieved using the EOS_Auth_CopyUserAuthToken API and stored by the application specifically for the active Nintendo Switch user.\n\n @see EOS_LCT_AccountPortal"]
    EOS_LCT_PersistentAuth = 2,
    #[doc = " Not supported. Superseded by EOS_LCT_ExternalAuth login method.\n\n @see EOS_LCT_ExternalAuth"]
    EOS_LCT_DeviceCode = 3,
    #[doc = " Login with named credentials hosted by the EOS SDK Developer Authentication Tool.\n\n @note Used for development purposes only."]
    EOS_LCT_Developer = 4,
    #[doc = " Refresh token that was retrieved from a previous call to EOS_Auth_Login API in another local process context.\n Mainly used in conjunction with custom desktop launcher applications.\n\n @details Can be used for example when launching the game from Epic Games Launcher and having an intermediate process\n in-between that requires authenticating the user before eventually starting the actual game client application.\n In such scenario, an intermediate launcher will log in the user by consuming the exchange code it received from the\n Epic Games Launcher. To allow the game client to also authenticate the user, it can copy the refresh token using the\n EOS_Auth_CopyUserAuthToken API and pass it via launch parameters to the started game client. The game client can then\n use the refresh token to log in the user."]
    EOS_LCT_RefreshToken = 5,
    #[doc = " Used by standalone applications distributed outside the supported game platforms such as Epic Games Store or Steam, and on Nintendo Switch.\n\n Login using the built-in user onboarding experience provided by the SDK, which will automatically store a persistent\n refresh token to enable automatic user login for consecutive application runs on the local device. Applications are\n expected to attempt automatic login using the EOS_LCT_PersistentAuth login method, and fall back to EOS_LCT_AccountPortal\n to prompt users for manual login.\n\n @note On Windows, using this login method requires applications to be started through the EOS Bootstrapper application\n and to have the local Epic Online Services redistributable installed on the local system. See EOS_Platform_GetDesktopCrossplayStatus\n for adding a readiness check prior to calling EOS_Auth_Login.\n\n @see EOS_LCT_PersistentAuth"]
    EOS_LCT_AccountPortal = 6,
    #[doc = " Login using external account provider credentials, such as PlayStation(TM)Network, Steam, and Xbox Live.\n\n This is the intended login method on PlayStation and Xbox console devices.\n On Desktop and Mobile, used when launched through any of the commonly supported platform clients.\n\n @details The user is seamlessly logged in to their Epic account using an external account access token.\n If the local platform account is already linked with the user's Epic account, the login will succeed and EOS_EResult::EOS_Success is returned.\n When the local platform account has not been linked with an Epic account yet,\n EOS_EResult::EOS_InvalidUser is returned and the EOS_ContinuanceToken will be set in the EOS_Auth_LoginCallbackInfo data.\n If EOS_EResult::EOS_InvalidUser is returned,\n the application should proceed to call the EOS_Auth_LinkAccount API with the EOS_ContinuanceToken to continue with the external account login\n and to link the external account at the end of the login flow.\n\n @details Login flow when the platform user account has not been linked with an Epic account yet:\n 1. Game calls EOS_Auth_Login with the EOS_LCT_ExternalAuth credential type.\n 2. EOS_Auth_Login returns EOS_EResult::EOS_InvalidUser with a non-null EOS_ContinuanceToken in the EOS_Auth_LoginCallbackInfo data.\n 3. Game calls EOS_Auth_LinkAccount with the EOS_ContinuanceToken to initiate the login flow for linking the platform account with the user's Epic account.\n 4. The user is taken automatically to the Epic accounts user onboarding flow managed by the SDK.\n 5. Once the user completes the login, cancels it or if the login flow times out, EOS_Auth_LinkAccount invokes the completion callback to the caller.\n    - If the user was logged in successfully, EOS_EResult::EOS_Success is returned in the EOS_Auth_LoginCallbackInfo. Otherwise, an error result code is returned accordingly.\n\n @note On Windows, using this login method requires applications to be started through the EOS Bootstrapper application\n and to have the local Epic Online Services redistributable installed on the local system. See EOS_Platform_GetDesktopCrossplayStatus\n for adding a readiness check prior to calling EOS_Auth_Login."]
    EOS_LCT_ExternalAuth = 7,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EAuthTokenType {
    #[doc = " Auth token is for a validated client"]
    EOS_ATT_Client = 0,
    #[doc = " Auth token is for a validated user"]
    EOS_ATT_User = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_Token {
    #[doc = " API Version: Set this to EOS_AUTH_TOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Name of the app related to the client ID involved with this token"]
    pub App: *const ::std::os::raw::c_char,
    #[doc = " Client ID that requested this token"]
    pub ClientId: *const ::std::os::raw::c_char,
    #[doc = " The Epic Account ID associated with this auth token"]
    pub AccountId: EOS_EpicAccountId,
    #[doc = " Access token for the current user login session"]
    pub AccessToken: *const ::std::os::raw::c_char,
    #[doc = " Time before the access token expires, in seconds, relative to the call to EOS_Auth_CopyUserAuthToken"]
    pub ExpiresIn: f64,
    #[doc = " Absolute time in UTC before the access token expires, in ISO 8601 format"]
    pub ExpiresAt: *const ::std::os::raw::c_char,
    #[doc = " Type of auth token"]
    pub AuthType: EOS_EAuthTokenType,
    #[doc = " Refresh token.\n\n @see EOS_ELoginCredentialType::EOS_LCT_RefreshToken"]
    pub RefreshToken: *const ::std::os::raw::c_char,
    #[doc = " Time before the access token expires, in seconds, relative to the call to EOS_Auth_CopyUserAuthToken"]
    pub RefreshExpiresIn: f64,
    #[doc = " Absolute time in UTC before the refresh token expires, in ISO 8601 format"]
    pub RefreshExpiresAt: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_Token() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_Token> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_Token>(),
        88usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_Token))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_Token>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_Token))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).App) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(App)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(ClientId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(AccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccessToken) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(AccessToken)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpiresIn) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(ExpiresIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpiresAt) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(ExpiresAt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AuthType) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(AuthType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshToken) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(RefreshToken)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshExpiresIn) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(RefreshExpiresIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshExpiresAt) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Token),
            "::",
            stringify!(RefreshExpiresAt)
        )
    );
}
pub type EOS_Auth_Token = _tagEOS_Auth_Token;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Auth_Token structure. This must be called on data retrieved from EOS_Auth_CopyUserAuthToken.\n\n @param AuthToken The auth token structure to be released.\n\n @see EOS_Auth_Token\n @see EOS_Auth_CopyUserAuthToken"]
    pub fn EOS_Auth_Token_Release(AuthToken: *mut EOS_Auth_Token);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_Credentials {
    #[doc = " API Version: Set this to EOS_AUTH_CREDENTIALS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Authentication ID value based on the used EOS_ELoginCredentialType.\n If not used, must be set to NULL."]
    pub Id: *const ::std::os::raw::c_char,
    #[doc = " Authentication Token value based on the used EOS_ELoginCredentialType.\n If not used, must be set to NULL."]
    pub Token: *const ::std::os::raw::c_char,
    #[doc = " Login credentials type based on the authentication method used."]
    pub Type: EOS_ELoginCredentialType,
    #[doc = " This field is for system specific options, if any.\n\n If provided, the structure will be located in (System)/eos_(system).h.\n The structure will be named EOS_(System)_Auth_CredentialsOptions."]
    pub SystemAuthCredentialsOptions: *mut ::std::os::raw::c_void,
    #[doc = " Type of external login. Needed to identify the external auth method to use.\n Used when login type is set to EOS_LCT_ExternalAuth, ignored for other EOS_ELoginCredentialType methods."]
    pub ExternalType: EOS_EExternalCredentialType,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_Credentials() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_Credentials> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_Credentials>(),
        48usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_Credentials))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_Credentials>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_Credentials))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Token) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(Token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).SystemAuthCredentialsOptions) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(SystemAuthCredentialsOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExternalType) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_Credentials),
            "::",
            stringify!(ExternalType)
        )
    );
}
pub type EOS_Auth_Credentials = _tagEOS_Auth_Credentials;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_PinGrantInfo {
    #[doc = " API Version: Set this to EOS_AUTH_PINGRANTINFO_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Code the user must input on an external device to activate the login."]
    pub UserCode: *const ::std::os::raw::c_char,
    #[doc = " The end-user verification URI. Users can be asked to manually type this into their browser."]
    pub VerificationURI: *const ::std::os::raw::c_char,
    #[doc = " Time the user has, in seconds, to complete the process or else timeout."]
    pub ExpiresIn: i32,
    #[doc = " A verification URI that includes the user code. Useful for non-textual transmission."]
    pub VerificationURIComplete: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_PinGrantInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_PinGrantInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_PinGrantInfo>(),
        40usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_PinGrantInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_PinGrantInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_PinGrantInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_PinGrantInfo),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserCode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_PinGrantInfo),
            "::",
            stringify!(UserCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VerificationURI) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_PinGrantInfo),
            "::",
            stringify!(VerificationURI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpiresIn) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_PinGrantInfo),
            "::",
            stringify!(ExpiresIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VerificationURIComplete) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_PinGrantInfo),
            "::",
            stringify!(VerificationURIComplete)
        )
    );
}
pub type EOS_Auth_PinGrantInfo = _tagEOS_Auth_PinGrantInfo;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EAuthScopeFlags {
    #[doc = " Flags that describe user permissions"]
    EOS_AS_NoFlags = 0,
    #[doc = " Permissions to see your account ID, display name, and language"]
    EOS_AS_BasicProfile = 1,
    #[doc = " Permissions to see a list of your friends who use this application"]
    EOS_AS_FriendsList = 2,
    #[doc = " Permissions to set your online presence and see presence of your friends"]
    EOS_AS_Presence = 4,
    #[doc = " Permissions to manage the Epic friends list. This scope is restricted to Epic first party products, and attempting to use it will result in authentication failures."]
    EOS_AS_FriendsManagement = 8,
    #[doc = " Permissions to see email in the response when fetching information for a user. This scope is restricted to Epic first party products, and attempting to use it will result in authentication failures."]
    EOS_AS_Email = 16,
    #[doc = " Permissions to see your country"]
    EOS_AS_Country = 32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LoginOptions {
    #[doc = " API Version: Set this to EOS_AUTH_LOGIN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Credentials specified for a given login method."]
    pub Credentials: *const EOS_Auth_Credentials,
    #[doc = " Auth scope flags are permissions to request from the user while they are logging in. This is a bitwise-or union of EOS_EAuthScopeFlags flags defined above."]
    pub ScopeFlags: EOS_EAuthScopeFlags,
    #[doc = " Optional flags for the desired login behavior, e.g. EOS_LF_NO_USER_INTERFACE. This is a bitwise-or union of the defined flags."]
    pub LoginFlags: u64,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LoginOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LoginOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LoginOptions>(),
        32usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_LoginOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LoginOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_LoginOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Credentials) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginOptions),
            "::",
            stringify!(Credentials)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ScopeFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginOptions),
            "::",
            stringify!(ScopeFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginFlags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginOptions),
            "::",
            stringify!(LoginFlags)
        )
    );
}
pub type EOS_Auth_LoginOptions = _tagEOS_Auth_LoginOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LoginCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_Login."]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user who has logged in."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Optional data that may be returned in the middle of the login flow, when neither the in-game overlay or a platform browser is used.\n This data is present when the ResultCode is EOS_Auth_PinGrantCode."]
    pub PinGrantInfo: *const EOS_Auth_PinGrantInfo,
    #[doc = " If the user was not found with external auth credentials passed into EOS_Auth_Login, this continuance token can be passed to EOS_Auth_LinkAccount to continue the flow."]
    pub ContinuanceToken: EOS_ContinuanceToken,
    #[doc = " Deprecated field that is no longer used."]
    pub AccountFeatureRestrictedInfo_DEPRECATED: *const EOS_Auth_AccountFeatureRestrictedInfo,
    #[doc = " The Epic Account ID that has been previously selected to be used for the current application.\n Applications should use this ID to authenticate with online backend services that store game-scoped data for users.\n\n Note: This ID may be different from LocalUserId if the user has previously merged Epic accounts into the account\n represented by LocalUserId, and one of the accounts that got merged had game data associated with it for the application."]
    pub SelectedAccountId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LoginCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LoginCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LoginCallbackInfo>(),
        56usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_LoginCallbackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LoginCallbackInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_LoginCallbackInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PinGrantInfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(PinGrantInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContinuanceToken) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(ContinuanceToken)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).AccountFeatureRestrictedInfo_DEPRECATED) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(AccountFeatureRestrictedInfo_DEPRECATED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectedAccountId) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginCallbackInfo),
            "::",
            stringify!(SelectedAccountId)
        )
    );
}
pub type EOS_Auth_LoginCallbackInfo = _tagEOS_Auth_LoginCallbackInfo;
pub type EOS_Auth_OnLoginCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_LoginCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LogoutOptions {
    #[doc = " API Version: Set this to EOS_AUTH_LOGOUT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user who is being logged out"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LogoutOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LogoutOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LogoutOptions>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_LogoutOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LogoutOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_LogoutOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LogoutOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LogoutOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Auth_LogoutOptions = _tagEOS_Auth_LogoutOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LogoutCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_Login"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user requesting the information"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LogoutCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LogoutCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LogoutCallbackInfo>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_LogoutCallbackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LogoutCallbackInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_LogoutCallbackInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LogoutCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LogoutCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LogoutCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Auth_LogoutCallbackInfo = _tagEOS_Auth_LogoutCallbackInfo;
pub type EOS_Auth_OnLogoutCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_LogoutCallbackInfo)>;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_ELinkAccountFlags {
    #[doc = " Default flag used for a standard account linking operation.\n\n This flag is set when using a continuance token received from a previous call to the EOS_Auth_Login API,\n when the local user has not yet been successfully logged in to an Epic Account yet."]
    EOS_LA_NoFlags = 0,
    #[doc = " Specified when the EOS_ContinuanceToken describes a Nintendo NSA ID account type.\n\n This flag is used only with, and must be set, when the continuance token was received from a previous call\n to the EOS_Auth_Login API using the EOS_EExternalCredentialType::EOS_ECT_NINTENDO_NSA_ID_TOKEN login type."]
    EOS_LA_NintendoNsaId = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LinkAccountOptions {
    #[doc = " API Version: Set this to EOS_AUTH_LINKACCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Combination of the enumeration flags to specify how the account linking operation will be performed."]
    pub LinkAccountFlags: EOS_ELinkAccountFlags,
    #[doc = " Continuance token received from a previous call to the EOS_Auth_Login API.\n\n A continuance token is received in the case when the external account used for login was not found to be linked\n against any existing Epic Account. In such case, the application needs to proceed with an account linking operation in which case\n the user is first asked to create a new account or login into their existing Epic Account, and then link their external account to it.\n Alternatively, the application may suggest the user to login using another external account that they have already linked to their existing Epic Account.\n In this flow, the external account is typically the currently logged in local platform user account.\n It can also be another external user account that the user is offered to login with."]
    pub ContinuanceToken: EOS_ContinuanceToken,
    #[doc = " The Epic Account ID of the logged in local user whose Epic Account will be linked with the local Nintendo NSA ID Account. By default set to NULL.\n\n This parameter is only used and required to be set when EOS_ELinkAccountFlags::EOS_LA_NintendoNsaId is specified.\n Otherwise, set to NULL, as the standard account linking and login flow using continuance token will handle logging in the user to their Epic Account."]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LinkAccountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LinkAccountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LinkAccountOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_LinkAccountOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LinkAccountOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_LinkAccountOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LinkAccountFlags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountOptions),
            "::",
            stringify!(LinkAccountFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContinuanceToken) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountOptions),
            "::",
            stringify!(ContinuanceToken)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Auth_LinkAccountOptions = _tagEOS_Auth_LinkAccountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LinkAccountCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_LinkAccount."]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose account has been linked during login."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Optional data that may be returned in the middle of the login flow, when neither the in-game overlay or a platform browser is used.\n This data is present when the ResultCode is EOS_Auth_PinGrantCode."]
    pub PinGrantInfo: *const EOS_Auth_PinGrantInfo,
    #[doc = " The Epic Account ID that has been previously selected to be used for the current application.\n Applications should use this ID to authenticate with online backend services that store game-scoped data for users.\n\n Note: This ID may be different from LocalUserId if the user has previously merged Epic accounts into the account\n represented by LocalUserId, and one of the accounts that got merged had game data associated with it for the application."]
    pub SelectedAccountId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LinkAccountCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LinkAccountCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LinkAccountCallbackInfo>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LinkAccountCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PinGrantInfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo),
            "::",
            stringify!(PinGrantInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectedAccountId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LinkAccountCallbackInfo),
            "::",
            stringify!(SelectedAccountId)
        )
    );
}
pub type EOS_Auth_LinkAccountCallbackInfo = _tagEOS_Auth_LinkAccountCallbackInfo;
pub type EOS_Auth_OnLinkAccountCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_LinkAccountCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_VerifyUserAuthOptions {
    #[doc = " API Version: Set this to EOS_AUTH_VERIFYUSERAUTH_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Auth token to verify against the backend service"]
    pub AuthToken: *const EOS_Auth_Token,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_VerifyUserAuthOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_VerifyUserAuthOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_VerifyUserAuthOptions>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_VerifyUserAuthOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_VerifyUserAuthOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_VerifyUserAuthOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyUserAuthOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AuthToken) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyUserAuthOptions),
            "::",
            stringify!(AuthToken)
        )
    );
}
pub type EOS_Auth_VerifyUserAuthOptions = _tagEOS_Auth_VerifyUserAuthOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_VerifyUserAuthCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_Login"]
    pub ClientData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_VerifyUserAuthCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_VerifyUserAuthCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_VerifyUserAuthCallbackInfo>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_VerifyUserAuthCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_VerifyUserAuthCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_VerifyUserAuthCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyUserAuthCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyUserAuthCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
}
pub type EOS_Auth_VerifyUserAuthCallbackInfo = _tagEOS_Auth_VerifyUserAuthCallbackInfo;
pub type EOS_Auth_OnVerifyUserAuthCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_VerifyUserAuthCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_CopyUserAuthTokenOptions {
    #[doc = " API Version: Set this to EOS_AUTH_COPYUSERAUTHTOKEN_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_CopyUserAuthTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_CopyUserAuthTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_CopyUserAuthTokenOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_CopyUserAuthTokenOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_CopyUserAuthTokenOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_CopyUserAuthTokenOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_CopyUserAuthTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_Auth_CopyUserAuthTokenOptions = _tagEOS_Auth_CopyUserAuthTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_CopyIdTokenOptions {
    #[doc = " API Version: Set this to EOS_AUTH_COPYIDTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the user being queried."]
    pub AccountId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_CopyIdTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_CopyIdTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_CopyIdTokenOptions>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_CopyIdTokenOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_CopyIdTokenOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_CopyIdTokenOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_CopyIdTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_CopyIdTokenOptions),
            "::",
            stringify!(AccountId)
        )
    );
}
pub type EOS_Auth_CopyIdTokenOptions = _tagEOS_Auth_CopyIdTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_IdToken {
    #[doc = " API Version: Set this to EOS_AUTH_IDTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID described by the ID token.\n Use EOS_EpicAccountId_FromString to populate this field when validating a received ID token."]
    pub AccountId: EOS_EpicAccountId,
    #[doc = " The ID token as a Json Web Token (JWT) string."]
    pub JsonWebToken: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_IdToken() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_IdToken> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_IdToken>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_IdToken))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_IdToken>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Auth_IdToken))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_IdToken),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_IdToken),
            "::",
            stringify!(AccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JsonWebToken) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_IdToken),
            "::",
            stringify!(JsonWebToken)
        )
    );
}
pub type EOS_Auth_IdToken = _tagEOS_Auth_IdToken;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Auth_IdToken structure. This must be called on data retrieved from EOS_Auth_CopyIdToken.\n\n @param IdToken The ID token structure to be released.\n\n @see EOS_Auth_IdToken\n @see EOS_Auth_CopyIdToken"]
    pub fn EOS_Auth_IdToken_Release(IdToken: *mut EOS_Auth_IdToken);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_QueryIdTokenOptions {
    #[doc = " API Version: Set this to EOS_AUTH_QUERYIDTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local authenticated user."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The target Epic Account ID for which to query an ID token.\n This account id may be the same as the input LocalUserId or another merged account id associated with the local user's Epic account.\n\n An ID token for the selected account id of a locally authenticated user will always be readily available.\n To retrieve it for the selected account ID, you can use EOS_Auth_CopyIdToken directly after a successful user login."]
    pub TargetAccountId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_QueryIdTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_QueryIdTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_QueryIdTokenOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_QueryIdTokenOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_QueryIdTokenOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_QueryIdTokenOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetAccountId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenOptions),
            "::",
            stringify!(TargetAccountId)
        )
    );
}
pub type EOS_Auth_QueryIdTokenOptions = _tagEOS_Auth_QueryIdTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_QueryIdTokenCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_QueryIdToken"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local authenticated user."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The target Epic Account ID for which the ID token was retrieved."]
    pub TargetAccountId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_QueryIdTokenCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_QueryIdTokenCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_QueryIdTokenCallbackInfo>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_QueryIdTokenCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetAccountId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_QueryIdTokenCallbackInfo),
            "::",
            stringify!(TargetAccountId)
        )
    );
}
pub type EOS_Auth_QueryIdTokenCallbackInfo = _tagEOS_Auth_QueryIdTokenCallbackInfo;
pub type EOS_Auth_OnQueryIdTokenCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_QueryIdTokenCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_VerifyIdTokenOptions {
    #[doc = " API Version: Set this to EOS_AUTH_VERIFYIDTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The ID token to verify.\n Use EOS_EpicAccountId_FromString to populate the AccountId field of this struct."]
    pub IdToken: *const EOS_Auth_IdToken,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_VerifyIdTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_VerifyIdTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_VerifyIdTokenOptions>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Auth_VerifyIdTokenOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_VerifyIdTokenOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_VerifyIdTokenOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IdToken) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenOptions),
            "::",
            stringify!(IdToken)
        )
    );
}
pub type EOS_Auth_VerifyIdTokenOptions = _tagEOS_Auth_VerifyIdTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_VerifyIdTokenCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_VerifyIdToken"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " Epic Account Services Application ID."]
    pub ApplicationId: *const ::std::os::raw::c_char,
    #[doc = " Client ID of the authorized client."]
    pub ClientId: *const ::std::os::raw::c_char,
    #[doc = " Product ID."]
    pub ProductId: *const ::std::os::raw::c_char,
    #[doc = " Sandbox ID."]
    pub SandboxId: *const ::std::os::raw::c_char,
    #[doc = " Deployment ID."]
    pub DeploymentId: *const ::std::os::raw::c_char,
    #[doc = " Epic Account display name.\n\n This value may be set to an empty string."]
    pub DisplayName: *const ::std::os::raw::c_char,
    #[doc = " Flag set to indicate whether external account information is present.\n Applications must always first check this value to be set before attempting\n to read the ExternalAccountIdType, ExternalAccountId, ExternalAccountDisplayName and Platform fields.\n\n This flag is set when the user has logged in to their Epic Account using external account credentials, e.g. through local platform authentication."]
    pub bIsExternalAccountInfoPresent: EOS_Bool,
    #[doc = " The identity provider that the user logged in with to their Epic Account.\n\n If bIsExternalAccountInfoPresent is set, this field describes the external account type."]
    pub ExternalAccountIdType: EOS_EExternalAccountType,
    #[doc = " The external account ID of the logged in user.\n\n This value may be set to an empty string."]
    pub ExternalAccountId: *const ::std::os::raw::c_char,
    #[doc = " The external account display name.\n\n This value may be set to an empty string."]
    pub ExternalAccountDisplayName: *const ::std::os::raw::c_char,
    #[doc = " Platform that the user is connected from.\n\n This value may be set to an empty string."]
    pub Platform: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_VerifyIdTokenCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_VerifyIdTokenCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_VerifyIdTokenCallbackInfo>(),
        96usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_VerifyIdTokenCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ApplicationId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ClientId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ProductId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxId) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(SandboxId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeploymentId) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(DeploymentId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisplayName) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(DisplayName)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).bIsExternalAccountInfoPresent) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(bIsExternalAccountInfoPresent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExternalAccountIdType) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ExternalAccountIdType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExternalAccountId) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ExternalAccountId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExternalAccountDisplayName) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(ExternalAccountDisplayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Platform) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_VerifyIdTokenCallbackInfo),
            "::",
            stringify!(Platform)
        )
    );
}
pub type EOS_Auth_VerifyIdTokenCallbackInfo = _tagEOS_Auth_VerifyIdTokenCallbackInfo;
pub type EOS_Auth_OnVerifyIdTokenCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Auth_VerifyIdTokenCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_AddNotifyLoginStatusChangedOptions {
    #[doc = " API Version: Set this to EOS_AUTH_ADDNOTIFYLOGINSTATUSCHANGED_API_LATEST."]
    pub ApiVersion: i32,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_AddNotifyLoginStatusChangedOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_AddNotifyLoginStatusChangedOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_AddNotifyLoginStatusChangedOptions>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_AddNotifyLoginStatusChangedOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_AddNotifyLoginStatusChangedOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_AddNotifyLoginStatusChangedOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_AddNotifyLoginStatusChangedOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
}
pub type EOS_Auth_AddNotifyLoginStatusChangedOptions =
    _tagEOS_Auth_AddNotifyLoginStatusChangedOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_DeletePersistentAuthOptions {
    #[doc = " API Version: Set this to EOS_AUTH_DELETEPERSISTENTAUTH_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " A long-lived refresh token that is used with the EOS_LCT_PersistentAuth login type and is to be revoked from the authentication server. Only used on Console platforms.\n On Desktop and Mobile platforms, set this parameter to NULL."]
    pub RefreshToken: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_DeletePersistentAuthOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_DeletePersistentAuthOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_DeletePersistentAuthOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_DeletePersistentAuthOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshToken) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthOptions),
            "::",
            stringify!(RefreshToken)
        )
    );
}
pub type EOS_Auth_DeletePersistentAuthOptions = _tagEOS_Auth_DeletePersistentAuthOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_DeletePersistentAuthCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Auth_DeletePersistentAuth"]
    pub ClientData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_DeletePersistentAuthCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_DeletePersistentAuthCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_DeletePersistentAuthCallbackInfo>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_DeletePersistentAuthCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_DeletePersistentAuthCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
}
pub type EOS_Auth_DeletePersistentAuthCallbackInfo = _tagEOS_Auth_DeletePersistentAuthCallbackInfo;
pub type EOS_Auth_OnDeletePersistentAuthCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Auth_DeletePersistentAuthCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Auth_LoginStatusChangedCallbackInfo {
    #[doc = " Context that was passed into EOS_Auth_AddNotifyLoginStatusChanged"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose status has changed"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The status prior to the change"]
    pub PrevStatus: EOS_ELoginStatus,
    #[doc = " The status at the time of the notification"]
    pub CurrentStatus: EOS_ELoginStatus,
}
#[test]
fn bindgen_test_layout__tagEOS_Auth_LoginStatusChangedCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Auth_LoginStatusChangedCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Auth_LoginStatusChangedCallbackInfo>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Auth_LoginStatusChangedCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PrevStatus) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo),
            "::",
            stringify!(PrevStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentStatus) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Auth_LoginStatusChangedCallbackInfo),
            "::",
            stringify!(CurrentStatus)
        )
    );
}
pub type EOS_Auth_LoginStatusChangedCallbackInfo = _tagEOS_Auth_LoginStatusChangedCallbackInfo;
pub type EOS_Auth_OnLoginStatusChangedCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Auth_LoginStatusChangedCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_EcomHandle {
    _unused: [u8; 0],
}
pub type EOS_HEcom = *mut EOS_EcomHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EOS_Ecom_TransactionHandle {
    _unused: [u8; 0],
}
#[doc = " This handle is copied when EOS_Ecom_CopyTransactionById or EOS_Ecom_CopyTransactionByIndex is called.\n A EOS_Ecom_CheckoutCallbackInfo provides the ID for the copy.\n After being copied, EOS_Ecom_Transaction_Release must be called.\n\n @see EOS_Ecom_CheckoutCallbackInfo\n @see EOS_Ecom_CopyTransactionById\n @see EOS_Ecom_CopyTransactionByIndex\n @see EOS_Ecom_Transaction_Release"]
pub type EOS_Ecom_HTransaction = *mut EOS_Ecom_TransactionHandle;
#[doc = " A unique identifier for a catalog item defined and stored with the backend catalog service.\n A catalog item represents a distinct object within the catalog.  When acquired by an account, an\n entitlement is granted that references a specific catalog item."]
pub type EOS_Ecom_CatalogItemId = *const ::std::os::raw::c_char;
#[doc = " A unique identifier for a catalog offer defined and stored with the backend catalog service.\n A catalog offer is a purchasable collection of 1 or more items, associated with a price (which\n could be 0).  When an offer is purchased an entitlement is granted for each of the items\n referenced by the offer."]
pub type EOS_Ecom_CatalogOfferId = *const ::std::os::raw::c_char;
#[doc = " An identifier which is defined on a catalog item and stored with the backend catalog service.\n The entitlement name may not be unique.  A catalog may be configured with multiple items with the\n same entitlement name in order to define a logical grouping of entitlements.  This is used to\n retrieve all entitlements granted to an account grouped in this way.\n\n @see EOS_Ecom_QueryEntitlements"]
pub type EOS_Ecom_EntitlementName = *const ::std::os::raw::c_char;
#[doc = " A unique identifier for an entitlement owned by an account.  An entitlement is always associated\n with a single account.  The entitlement ID is provided to allow redeeming the entitlement as\n well as identify individual entitlement grants.\n\n @see EOS_Ecom_QueryEntitlements\n @see EOS_Ecom_RedeemEntitlements"]
pub type EOS_Ecom_EntitlementId = *const ::std::os::raw::c_char;
#[doc = " A unique identifier for the Sandbox.\n\n @see EOS_Ecom_QueryOwnershipBySandboxIds"]
pub type EOS_Ecom_SandboxId = *const ::std::os::raw::c_char;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EOwnershipStatus {
    #[doc = " The catalog item is not owned by the local user"]
    EOS_OS_NotOwned = 0,
    #[doc = " The catalog item is owned by the local user"]
    EOS_OS_Owned = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum EOS_EEcomItemType {
    #[doc = " This entitlement is intended to persist."]
    EOS_EIT_Durable = 0,
    #[doc = " This entitlement is intended to be transient and redeemed.\n\n @see EOS_Ecom_RedeemEntitlements"]
    EOS_EIT_Consumable = 1,
    #[doc = " This entitlement has a type that is not currently intended for an in-game store."]
    EOS_EIT_Other = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_Entitlement {
    #[doc = " API Version: Set this to EOS_ECOM_ENTITLEMENT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Name of the entitlement"]
    pub EntitlementName: EOS_Ecom_EntitlementName,
    #[doc = " ID of the entitlement owned by an account"]
    pub EntitlementId: EOS_Ecom_EntitlementId,
    #[doc = " ID of the item associated with the offer which granted this entitlement"]
    pub CatalogItemId: EOS_Ecom_CatalogItemId,
    #[doc = " If queried using pagination then ServerIndex represents the index of the entitlement as it\n exists on the server.  If not queried using pagination then ServerIndex will be -1."]
    pub ServerIndex: i32,
    #[doc = " If true then the catalog has this entitlement marked as redeemed"]
    pub bRedeemed: EOS_Bool,
    #[doc = " If not -1 then this is a POSIX timestamp that this entitlement will end"]
    pub EndTimestamp: i64,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_Entitlement() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_Entitlement> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_Entitlement>(),
        48usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_Entitlement))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_Entitlement>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_Entitlement))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(EntitlementName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(EntitlementId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogItemId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(CatalogItemId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ServerIndex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(ServerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRedeemed) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(bRedeemed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EndTimestamp) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_Entitlement),
            "::",
            stringify!(EndTimestamp)
        )
    );
}
pub type EOS_Ecom_Entitlement = _tagEOS_Ecom_Entitlement;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Ecom_Entitlement structure. This must be called on data\n retrieved from EOS_Ecom_CopyEntitlementByIndex and EOS_Ecom_CopyEntitlementById.\n\n @param Entitlement - The entitlement structure to be released\n\n @see EOS_Ecom_Entitlement\n @see EOS_Ecom_CopyEntitlementByIndex\n @see EOS_Ecom_CopyEntitlementById"]
    pub fn EOS_Ecom_Entitlement_Release(Entitlement: *mut EOS_Ecom_Entitlement);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_ItemOwnership {
    #[doc = " API Version: Set this to EOS_ECOM_ITEMOWNERSHIP_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " ID of the catalog item"]
    pub Id: EOS_Ecom_CatalogItemId,
    #[doc = " Is this catalog item owned by the local user"]
    pub OwnershipStatus: EOS_EOwnershipStatus,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_ItemOwnership() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_ItemOwnership> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_ItemOwnership>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_ItemOwnership))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_ItemOwnership>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_ItemOwnership))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_ItemOwnership),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_ItemOwnership),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OwnershipStatus) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_ItemOwnership),
            "::",
            stringify!(OwnershipStatus)
        )
    );
}
pub type EOS_Ecom_ItemOwnership = _tagEOS_Ecom_ItemOwnership;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CatalogItem {
    #[doc = " API Version: Set this to EOS_ECOM_CATALOGITEM_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Product namespace in which this item exists"]
    pub CatalogNamespace: *const ::std::os::raw::c_char,
    #[doc = " The ID of this item"]
    pub Id: EOS_Ecom_CatalogItemId,
    #[doc = " The entitlement name associated with this item"]
    pub EntitlementName: EOS_Ecom_EntitlementName,
    #[doc = " Localized UTF-8 title of this item"]
    pub TitleText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 description of this item"]
    pub DescriptionText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 long description of this item"]
    pub LongDescriptionText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 technical details of this item"]
    pub TechnicalDetailsText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 developer of this item"]
    pub DeveloperText: *const ::std::os::raw::c_char,
    #[doc = " The type of item as defined in the catalog"]
    pub ItemType: EOS_EEcomItemType,
    #[doc = " If not -1 then this is the POSIX timestamp that the entitlement will end"]
    pub EntitlementEndTimestamp: i64,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CatalogItem() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CatalogItem> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CatalogItem>(),
        88usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CatalogItem))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CatalogItem>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_CatalogItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogNamespace) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(CatalogNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(EntitlementName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TitleText) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(TitleText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DescriptionText) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(DescriptionText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongDescriptionText) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(LongDescriptionText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TechnicalDetailsText) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(TechnicalDetailsText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeveloperText) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(DeveloperText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemType) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(ItemType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementEndTimestamp) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogItem),
            "::",
            stringify!(EntitlementEndTimestamp)
        )
    );
}
pub type EOS_Ecom_CatalogItem = _tagEOS_Ecom_CatalogItem;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Ecom_CatalogItem structure. This must be called on data\n retrieved from EOS_Ecom_CopyOfferItemByIndex.\n\n @param CatalogItem - The catalog item structure to be released\n\n @see EOS_Ecom_CatalogItem\n @see EOS_Ecom_CopyOfferItemByIndex"]
    pub fn EOS_Ecom_CatalogItem_Release(CatalogItem: *mut EOS_Ecom_CatalogItem);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CatalogOffer {
    #[doc = " API Version: Set this to EOS_ECOM_CATALOGOFFER_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The index of this offer as it exists on the server.\n This is useful for understanding pagination data."]
    pub ServerIndex: i32,
    #[doc = " Product namespace in which this offer exists"]
    pub CatalogNamespace: *const ::std::os::raw::c_char,
    #[doc = " The ID of this offer"]
    pub Id: EOS_Ecom_CatalogOfferId,
    #[doc = " Localized UTF-8 title of this offer"]
    pub TitleText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 description of this offer"]
    pub DescriptionText: *const ::std::os::raw::c_char,
    #[doc = " Localized UTF-8 long description of this offer"]
    pub LongDescriptionText: *const ::std::os::raw::c_char,
    #[doc = " Deprecated.\n EOS_Ecom_CatalogItem::TechnicalDetailsText is still valid."]
    pub TechnicalDetailsText_DEPRECATED: *const ::std::os::raw::c_char,
    #[doc = " The Currency Code for this offer"]
    pub CurrencyCode: *const ::std::os::raw::c_char,
    #[doc = " If this value is EOS_Success then OriginalPrice, CurrentPrice, and DiscountPercentage contain valid data.\n Otherwise this value represents the error that occurred on the price query."]
    pub PriceResult: EOS_EResult,
    #[doc = " The original price of this offer as a 32-bit number is deprecated."]
    pub OriginalPrice_DEPRECATED: u32,
    #[doc = " The current price including discounts of this offer as a 32-bit number is deprecated.."]
    pub CurrentPrice_DEPRECATED: u32,
    #[doc = " A value from 0 to 100 define the percentage of the OrignalPrice that the CurrentPrice represents"]
    pub DiscountPercentage: u8,
    #[doc = " Contains the POSIX timestamp that the offer expires or -1 if it does not expire"]
    pub ExpirationTimestamp: i64,
    #[doc = " The number of times that the requesting account has purchased this offer.\n This value is deprecated and the backend no longer returns this value."]
    pub PurchasedCount_DEPRECATED: u32,
    #[doc = " The maximum number of times that the offer can be purchased.\n A negative value implies there is no limit."]
    pub PurchaseLimit: i32,
    #[doc = " True if the user can purchase this offer."]
    pub bAvailableForPurchase: EOS_Bool,
    #[doc = " The original price of this offer as a 64-bit number."]
    pub OriginalPrice64: u64,
    #[doc = " The current price including discounts of this offer as a 64-bit number."]
    pub CurrentPrice64: u64,
    #[doc = " The decimal point for the provided price.  For example, DecimalPoint '2' and CurrentPrice64 '12345' would be '123.45'."]
    pub DecimalPoint: u32,
    #[doc = " Timestamp indicating when the time when the offer was released. Can be ignored if set to -1."]
    pub ReleaseDateTimestamp: i64,
    #[doc = " Timestamp indicating the effective date of the offer. Can be ignored if set to -1."]
    pub EffectiveDateTimestamp: i64,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CatalogOffer() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CatalogOffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CatalogOffer>(),
        144usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CatalogOffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CatalogOffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_CatalogOffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ServerIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(ServerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogNamespace) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(CatalogNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TitleText) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(TitleText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DescriptionText) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(DescriptionText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongDescriptionText) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(LongDescriptionText)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).TechnicalDetailsText_DEPRECATED) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(TechnicalDetailsText_DEPRECATED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(CurrencyCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PriceResult) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(PriceResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OriginalPrice_DEPRECATED) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(OriginalPrice_DEPRECATED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentPrice_DEPRECATED) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(CurrentPrice_DEPRECATED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DiscountPercentage) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(DiscountPercentage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpirationTimestamp) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(ExpirationTimestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PurchasedCount_DEPRECATED) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(PurchasedCount_DEPRECATED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PurchaseLimit) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(PurchaseLimit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bAvailableForPurchase) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(bAvailableForPurchase)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OriginalPrice64) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(OriginalPrice64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentPrice64) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(CurrentPrice64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DecimalPoint) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(DecimalPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseDateTimestamp) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(ReleaseDateTimestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EffectiveDateTimestamp) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogOffer),
            "::",
            stringify!(EffectiveDateTimestamp)
        )
    );
}
pub type EOS_Ecom_CatalogOffer = _tagEOS_Ecom_CatalogOffer;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Ecom_CatalogOffer structure. This must be called on data\n retrieved from EOS_Ecom_CopyOfferByIndex.\n\n @param CatalogOffer - The catalog offer structure to be released\n\n @see EOS_Ecom_CatalogOffer\n @see EOS_Ecom_CopyOfferByIndex"]
    pub fn EOS_Ecom_CatalogOffer_Release(CatalogOffer: *mut EOS_Ecom_CatalogOffer);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_KeyImageInfo {
    #[doc = " API Version: Set this to EOS_ECOM_KEYIMAGEINFO_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " Describes the usage of the image (ex: home_thumbnail)"]
    pub Type: *const ::std::os::raw::c_char,
    #[doc = " The URL of the image"]
    pub Url: *const ::std::os::raw::c_char,
    #[doc = " The expected width in pixels of the image"]
    pub Width: u32,
    #[doc = " The expected height in pixels of the image"]
    pub Height: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_KeyImageInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_KeyImageInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_KeyImageInfo>(),
        32usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_KeyImageInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_KeyImageInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_KeyImageInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_KeyImageInfo),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_KeyImageInfo),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Url) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_KeyImageInfo),
            "::",
            stringify!(Url)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_KeyImageInfo),
            "::",
            stringify!(Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_KeyImageInfo),
            "::",
            stringify!(Height)
        )
    );
}
pub type EOS_Ecom_KeyImageInfo = _tagEOS_Ecom_KeyImageInfo;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Ecom_KeyImageInfo structure. This must be called on data\n retrieved from EOS_Ecom_CopyItemImageInfoByIndex.\n\n @param KeyImageInfo - The key image info structure to be released\n\n @see EOS_Ecom_KeyImageInfo\n @see EOS_Ecom_CopyItemImageInfoByIndex"]
    pub fn EOS_Ecom_KeyImageInfo_Release(KeyImageInfo: *mut EOS_Ecom_KeyImageInfo);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CatalogRelease {
    #[doc = " API Version: Set this to EOS_ECOM_CATALOGRELEASE_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The number of APP IDs"]
    pub CompatibleAppIdCount: u32,
    #[doc = " A list of compatible APP IDs"]
    pub CompatibleAppIds: *mut *const ::std::os::raw::c_char,
    #[doc = " The number of platforms"]
    pub CompatiblePlatformCount: u32,
    #[doc = " A list of compatible Platforms"]
    pub CompatiblePlatforms: *mut *const ::std::os::raw::c_char,
    #[doc = " Release note for compatible versions"]
    pub ReleaseNote: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CatalogRelease() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CatalogRelease> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CatalogRelease>(),
        40usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CatalogRelease))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CatalogRelease>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_CatalogRelease))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompatibleAppIdCount) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(CompatibleAppIdCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompatibleAppIds) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(CompatibleAppIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompatiblePlatformCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(CompatiblePlatformCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompatiblePlatforms) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(CompatiblePlatforms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseNote) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CatalogRelease),
            "::",
            stringify!(ReleaseNote)
        )
    );
}
pub type EOS_Ecom_CatalogRelease = _tagEOS_Ecom_CatalogRelease;
extern "C" {
    #[doc = " Release the memory associated with an EOS_Ecom_CatalogRelease structure. This must be called on\n data retrieved from EOS_Ecom_CopyItemReleaseByIndex.\n\n @param CatalogRelease - The catalog release structure to be released\n\n @see EOS_Ecom_CatalogRelease\n @see EOS_Ecom_CopyItemReleaseByIndex"]
    pub fn EOS_Ecom_CatalogRelease_Release(CatalogRelease: *mut EOS_Ecom_CatalogRelease);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CheckoutEntry {
    #[doc = " API Version: Set this to EOS_ECOM_CHECKOUTENTRY_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The ID of the offer to purchase"]
    pub OfferId: EOS_Ecom_CatalogOfferId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CheckoutEntry() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CheckoutEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CheckoutEntry>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CheckoutEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CheckoutEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_CheckoutEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutEntry),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutEntry),
            "::",
            stringify!(OfferId)
        )
    );
}
pub type EOS_Ecom_CheckoutEntry = _tagEOS_Ecom_CheckoutEntry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYOWNERSHIP_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose ownership to query"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The array of Catalog Item IDs to check for ownership"]
    pub CatalogItemIds: *mut EOS_Ecom_CatalogItemId,
    #[doc = " The number of Catalog Item IDs to in the array"]
    pub CatalogItemIdCount: u32,
    #[doc = " Optional product namespace, if not the one specified during initialization"]
    pub CatalogNamespace: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipOptions>(),
        40usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_QueryOwnershipOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogItemIds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions),
            "::",
            stringify!(CatalogItemIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogItemIdCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions),
            "::",
            stringify!(CatalogItemIdCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogNamespace) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipOptions),
            "::",
            stringify!(CatalogNamespace)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipOptions = _tagEOS_Ecom_QueryOwnershipOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryOwnership"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose ownership was queried"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " List of catalog items and their ownership status"]
    pub ItemOwnership: *const EOS_Ecom_ItemOwnership,
    #[doc = " Number of ownership results are included in this callback"]
    pub ItemOwnershipCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipCallbackInfo>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemOwnership) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo),
            "::",
            stringify!(ItemOwnership)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemOwnershipCount) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipCallbackInfo),
            "::",
            stringify!(ItemOwnershipCount)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipCallbackInfo = _tagEOS_Ecom_QueryOwnershipCallbackInfo;
pub type EOS_Ecom_OnQueryOwnershipCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Ecom_QueryOwnershipCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYOWNERSHIPBYSANDBOXIDSOPTIONS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose ownership to query."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The array of Sandbox IDs to check for ownership."]
    pub SandboxIds: *mut EOS_Ecom_SandboxId,
    #[doc = " The number of Sandbox IDs in the query."]
    pub SandboxIdsCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxIds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions),
            "::",
            stringify!(SandboxIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxIdsCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions),
            "::",
            stringify!(SandboxIdsCount)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipBySandboxIdsOptions =
    _tagEOS_Ecom_QueryOwnershipBySandboxIdsOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_SandboxIdItemOwnership {
    #[doc = " SandboxId"]
    pub SandboxId: EOS_Ecom_SandboxId,
    #[doc = " List of all owned catalog items for this SandboxId"]
    pub OwnedCatalogItemIds: *const EOS_Ecom_CatalogItemId,
    #[doc = " Number of owned catalog items for this SandboxId"]
    pub OwnedCatalogItemIdsCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_SandboxIdItemOwnership() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_SandboxIdItemOwnership> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_SandboxIdItemOwnership>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_SandboxIdItemOwnership))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_SandboxIdItemOwnership>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_SandboxIdItemOwnership)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_SandboxIdItemOwnership),
            "::",
            stringify!(SandboxId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OwnedCatalogItemIds) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_SandboxIdItemOwnership),
            "::",
            stringify!(OwnedCatalogItemIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OwnedCatalogItemIdsCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_SandboxIdItemOwnership),
            "::",
            stringify!(OwnedCatalogItemIdsCount)
        )
    );
}
pub type EOS_Ecom_SandboxIdItemOwnership = _tagEOS_Ecom_SandboxIdItemOwnership;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryOwnership"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose ownership was queried"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " List of SandboxIds and their corresponding owned catalog item Ids. If there are no ownership items, the OwnedCatalogItemIdsCount is 0 and OwnedCatalogItemIds is null."]
    pub SandboxIdItemOwnerships: *const EOS_Ecom_SandboxIdItemOwnership,
    #[doc = " Number of ownership results are included in this callback"]
    pub SandboxIdItemOwnershipsCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SandboxIdItemOwnerships) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
            "::",
            stringify!(SandboxIdItemOwnerships)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).SandboxIdItemOwnershipsCount) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
            "::",
            stringify!(SandboxIdItemOwnershipsCount)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo =
    _tagEOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo;
pub type EOS_Ecom_OnQueryOwnershipBySandboxIdsCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Ecom_QueryOwnershipBySandboxIdsCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipTokenOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYOWNERSHIPTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose ownership token you want to query"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The array of Catalog Item IDs to check for ownership, matching in number to the CatalogItemIdCount"]
    pub CatalogItemIds: *mut EOS_Ecom_CatalogItemId,
    #[doc = " The number of catalog item IDs to query"]
    pub CatalogItemIdCount: u32,
    #[doc = " Optional product namespace, if not the one specified during initialization"]
    pub CatalogNamespace: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipTokenOptions>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipTokenOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogItemIds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions),
            "::",
            stringify!(CatalogItemIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogItemIdCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions),
            "::",
            stringify!(CatalogItemIdCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CatalogNamespace) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenOptions),
            "::",
            stringify!(CatalogNamespace)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipTokenOptions = _tagEOS_Ecom_QueryOwnershipTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOwnershipTokenCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryOwnershipToken"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose ownership token was queried"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Ownership token containing details about the catalog items queried"]
    pub OwnershipToken: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOwnershipTokenCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OwnershipToken) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOwnershipTokenCallbackInfo),
            "::",
            stringify!(OwnershipToken)
        )
    );
}
pub type EOS_Ecom_QueryOwnershipTokenCallbackInfo = _tagEOS_Ecom_QueryOwnershipTokenCallbackInfo;
pub type EOS_Ecom_OnQueryOwnershipTokenCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Ecom_QueryOwnershipTokenCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryEntitlementsOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYENTITLEMENTS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose Entitlements you want to retrieve"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " An array of Entitlement Names that you want to check"]
    pub EntitlementNames: *mut EOS_Ecom_EntitlementName,
    #[doc = " The number of Entitlement Names included in the array, up to EOS_ECOM_QUERYENTITLEMENTS_MAX_ENTITLEMENT_IDS; use zero to request all Entitlements associated with the user's Epic Online Services account."]
    pub EntitlementNameCount: u32,
    #[doc = " If true, Entitlements that have been redeemed will be included in the results."]
    pub bIncludeRedeemed: EOS_Bool,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryEntitlementsOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryEntitlementsOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryEntitlementsOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryEntitlementsOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementNames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions),
            "::",
            stringify!(EntitlementNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementNameCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions),
            "::",
            stringify!(EntitlementNameCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIncludeRedeemed) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsOptions),
            "::",
            stringify!(bIncludeRedeemed)
        )
    );
}
pub type EOS_Ecom_QueryEntitlementsOptions = _tagEOS_Ecom_QueryEntitlementsOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryEntitlementsCallbackInfo {
    #[doc = " Output parameters for the EOS_Ecom_QueryEntitlements Function."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryEntitlements"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose entitlement was queried"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryEntitlementsCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryEntitlementsCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryEntitlementsCallbackInfo>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryEntitlementsCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementsCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_QueryEntitlementsCallbackInfo = _tagEOS_Ecom_QueryEntitlementsCallbackInfo;
pub type EOS_Ecom_OnQueryEntitlementsCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Ecom_QueryEntitlementsCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryEntitlementTokenOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYENTITLEMENTTOKEN_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose Entitlements you want to retrieve"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " An array of Entitlement Names that you want to check"]
    pub EntitlementNames: *mut EOS_Ecom_EntitlementName,
    #[doc = " The number of Entitlement Names included in the array, up to EOS_ECOM_QUERYENTITLEMENTTOKEN_MAX_ENTITLEMENT_IDS; use zero to request all Entitlements associated with the user's Epic Online Services account."]
    pub EntitlementNameCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryEntitlementTokenOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryEntitlementTokenOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryEntitlementTokenOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryEntitlementTokenOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementNames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions),
            "::",
            stringify!(EntitlementNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementNameCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenOptions),
            "::",
            stringify!(EntitlementNameCount)
        )
    );
}
pub type EOS_Ecom_QueryEntitlementTokenOptions = _tagEOS_Ecom_QueryEntitlementTokenOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryEntitlementTokenCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryEntitlementToken"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose entitlement was queried"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Entitlements token containing details about the catalog items queried"]
    pub EntitlementToken: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryEntitlementTokenCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementToken) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryEntitlementTokenCallbackInfo),
            "::",
            stringify!(EntitlementToken)
        )
    );
}
pub type EOS_Ecom_QueryEntitlementTokenCallbackInfo =
    _tagEOS_Ecom_QueryEntitlementTokenCallbackInfo;
pub type EOS_Ecom_OnQueryEntitlementTokenCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Ecom_QueryEntitlementTokenCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOffersOptions {
    #[doc = " API Version: Set this to EOS_ECOM_QUERYOFFERS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offer to query"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " If not provided then the SandboxId is used as the catalog namespace"]
    pub OverrideCatalogNamespace: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOffersOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOffersOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOffersOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_QueryOffersOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOffersOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_QueryOffersOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideCatalogNamespace) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersOptions),
            "::",
            stringify!(OverrideCatalogNamespace)
        )
    );
}
pub type EOS_Ecom_QueryOffersOptions = _tagEOS_Ecom_QueryOffersOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_QueryOffersCallbackInfo {
    #[doc = " The EOS_EResult code for the operation. EOS_Success indicates that the operation succeeded; other codes indicate errors."]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_QueryOffers"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the local user whose offer was queried; needed for localization of Catalog Item (Item) description text and pricing information"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_QueryOffersCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_QueryOffersCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_QueryOffersCallbackInfo>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_QueryOffersCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_QueryOffersCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_QueryOffersCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_QueryOffersCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_QueryOffersCallbackInfo = _tagEOS_Ecom_QueryOffersCallbackInfo;
pub type EOS_Ecom_OnQueryOffersCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Ecom_QueryOffersCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CheckoutOptions {
    #[doc = " API Version: Set this to EOS_ECOM_CHECKOUT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user who is making the purchase"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The catalog namespace will be the current Sandbox ID (in EOS_Platform_Options) unless overridden by this field"]
    pub OverrideCatalogNamespace: *const ::std::os::raw::c_char,
    #[doc = " The number of EOS_Ecom_CheckoutEntry elements contained in Entries"]
    pub EntryCount: u32,
    #[doc = " An array of EOS_Ecom_CheckoutEntry elements, each containing the details of a single offer"]
    pub Entries: *const EOS_Ecom_CheckoutEntry,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CheckoutOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CheckoutOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CheckoutOptions>(),
        40usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CheckoutOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CheckoutOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(_tagEOS_Ecom_CheckoutOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideCatalogNamespace) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutOptions),
            "::",
            stringify!(OverrideCatalogNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntryCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutOptions),
            "::",
            stringify!(EntryCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Entries) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutOptions),
            "::",
            stringify!(Entries)
        )
    );
}
pub type EOS_Ecom_CheckoutOptions = _tagEOS_Ecom_CheckoutOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CheckoutCallbackInfo {
    #[doc = " Result code for the operation. EOS_Success is returned for a successful request, otherwise one of the error codes is returned. See eos_common.h"]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_Checkout"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the user who initiated the purchase"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The transaction ID which can be used to obtain an EOS_Ecom_HTransaction using EOS_Ecom_CopyTransactionById."]
    pub TransactionId: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CheckoutCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CheckoutCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CheckoutCallbackInfo>(),
        32usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CheckoutCallbackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CheckoutCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CheckoutCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TransactionId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CheckoutCallbackInfo),
            "::",
            stringify!(TransactionId)
        )
    );
}
pub type EOS_Ecom_CheckoutCallbackInfo = _tagEOS_Ecom_CheckoutCallbackInfo;
pub type EOS_Ecom_OnCheckoutCallback =
    ::std::option::Option<unsafe extern "C" fn(Data: *const EOS_Ecom_CheckoutCallbackInfo)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_RedeemEntitlementsOptions {
    #[doc = " API Version: Set this to EOS_ECOM_REDEEMENTITLEMENTS_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the user who is redeeming Entitlements"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The number of Entitlements to redeem"]
    pub EntitlementIdCount: u32,
    #[doc = " The array of Entitlements to redeem"]
    pub EntitlementIds: *mut EOS_Ecom_EntitlementId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_RedeemEntitlementsOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_RedeemEntitlementsOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_RedeemEntitlementsOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_RedeemEntitlementsOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementIdCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions),
            "::",
            stringify!(EntitlementIdCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementIds) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsOptions),
            "::",
            stringify!(EntitlementIds)
        )
    );
}
pub type EOS_Ecom_RedeemEntitlementsOptions = _tagEOS_Ecom_RedeemEntitlementsOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_RedeemEntitlementsCallbackInfo {
    #[doc = " Result code for the operation. EOS_Success is returned for a successful request, otherwise one of the error codes is returned. See eos_common.h"]
    pub ResultCode: EOS_EResult,
    #[doc = " Context that was passed into EOS_Ecom_RedeemEntitlements"]
    pub ClientData: *mut ::std::os::raw::c_void,
    #[doc = " The Epic Account ID of the user who has redeemed entitlements"]
    pub LocalUserId: EOS_EpicAccountId,
    pub RedeemedEntitlementIdsCount: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_RedeemEntitlementsCallbackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_RedeemEntitlementsCallbackInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_RedeemEntitlementsCallbackInfo>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_RedeemEntitlementsCallbackInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResultCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo),
            "::",
            stringify!(ResultCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo),
            "::",
            stringify!(ClientData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RedeemedEntitlementIdsCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_RedeemEntitlementsCallbackInfo),
            "::",
            stringify!(RedeemedEntitlementIdsCount)
        )
    );
}
pub type EOS_Ecom_RedeemEntitlementsCallbackInfo = _tagEOS_Ecom_RedeemEntitlementsCallbackInfo;
pub type EOS_Ecom_OnRedeemEntitlementsCallback = ::std::option::Option<
    unsafe extern "C" fn(Data: *const EOS_Ecom_RedeemEntitlementsCallbackInfo),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETLASTREDEEMEDENTITLEMENTSCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user for who to retrieve the last redeemed entitlements count"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_GetLastRedeemedEntitlementsCountOptions =
    _tagEOS_Ecom_GetLastRedeemedEntitlementsCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYLASTREDEEMEDENTITLEMENTBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose last redeemed entitlement id is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Index of the last redeemed entitlement id to retrieve from the cache"]
    pub RedeemedEntitlementIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RedeemedEntitlementIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions),
            "::",
            stringify!(RedeemedEntitlementIndex)
        )
    );
}
pub type EOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions =
    _tagEOS_Ecom_CopyLastRedeemedEntitlementByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetEntitlementsCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETENTITLEMENTSCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user for which to retrieve the entitlement count"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetEntitlementsCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetEntitlementsCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetEntitlementsCountOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetEntitlementsCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetEntitlementsCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_GetEntitlementsCountOptions = _tagEOS_Ecom_GetEntitlementsCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetEntitlementsByNameCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETENTITLEMENTSBYNAMECOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user for which to retrieve the entitlement count"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Name of the entitlement to count in the cache"]
    pub EntitlementName: EOS_Ecom_EntitlementName,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetEntitlementsByNameCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetEntitlementsByNameCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetEntitlementsByNameCountOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsByNameCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetEntitlementsByNameCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetEntitlementsByNameCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsByNameCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsByNameCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetEntitlementsByNameCountOptions),
            "::",
            stringify!(EntitlementName)
        )
    );
}
pub type EOS_Ecom_GetEntitlementsByNameCountOptions =
    _tagEOS_Ecom_GetEntitlementsByNameCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyEntitlementByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYENTITLEMENTBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose entitlement is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Index of the entitlement to retrieve from the cache"]
    pub EntitlementIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyEntitlementByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyEntitlementByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyEntitlementByIndexOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyEntitlementByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIndexOptions),
            "::",
            stringify!(EntitlementIndex)
        )
    );
}
pub type EOS_Ecom_CopyEntitlementByIndexOptions = _tagEOS_Ecom_CopyEntitlementByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYENTITLEMENTBYNAMEANDINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose entitlement is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " Name of the entitlement to retrieve from the cache"]
    pub EntitlementName: EOS_Ecom_EntitlementName,
    #[doc = " Index of the entitlement within the named set to retrieve from the cache."]
    pub Index: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions),
            "::",
            stringify!(EntitlementName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Index) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions),
            "::",
            stringify!(Index)
        )
    );
}
pub type EOS_Ecom_CopyEntitlementByNameAndIndexOptions =
    _tagEOS_Ecom_CopyEntitlementByNameAndIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyEntitlementByIdOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYENTITLEMENTBYID_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose entitlement is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " ID of the entitlement to retrieve from the cache"]
    pub EntitlementId: EOS_Ecom_EntitlementId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyEntitlementByIdOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyEntitlementByIdOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyEntitlementByIdOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIdOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyEntitlementByIdOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIdOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIdOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIdOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EntitlementId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyEntitlementByIdOptions),
            "::",
            stringify!(EntitlementId)
        )
    );
}
pub type EOS_Ecom_CopyEntitlementByIdOptions = _tagEOS_Ecom_CopyEntitlementByIdOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetOfferCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETOFFERCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offers are being accessed"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetOfferCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetOfferCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetOfferCountOptions>(),
        16usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_GetOfferCountOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetOfferCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetOfferCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_GetOfferCountOptions = _tagEOS_Ecom_GetOfferCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyOfferByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYOFFERBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offer is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The index of the offer to get."]
    pub OfferIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyOfferByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyOfferByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyOfferByIndexOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyOfferByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyOfferByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIndexOptions),
            "::",
            stringify!(OfferIndex)
        )
    );
}
pub type EOS_Ecom_CopyOfferByIndexOptions = _tagEOS_Ecom_CopyOfferByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyOfferByIdOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYOFFERBYID_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offer is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the offer to get."]
    pub OfferId: EOS_Ecom_CatalogOfferId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyOfferByIdOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyOfferByIdOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyOfferByIdOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CopyOfferByIdOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyOfferByIdOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyOfferByIdOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIdOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIdOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferByIdOptions),
            "::",
            stringify!(OfferId)
        )
    );
}
pub type EOS_Ecom_CopyOfferByIdOptions = _tagEOS_Ecom_CopyOfferByIdOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetOfferItemCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETOFFERITEMCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user who made the initial request for the Catalog Offer through EOS_Ecom_QueryOffers"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " An ID that corresponds to a cached Catalog Offer (retrieved by EOS_Ecom_CopyOfferByIndex)"]
    pub OfferId: EOS_Ecom_CatalogOfferId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetOfferItemCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetOfferItemCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetOfferItemCountOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetOfferItemCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetOfferItemCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetOfferItemCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferItemCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferItemCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferItemCountOptions),
            "::",
            stringify!(OfferId)
        )
    );
}
pub type EOS_Ecom_GetOfferItemCountOptions = _tagEOS_Ecom_GetOfferItemCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyOfferItemByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYOFFERITEMBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the offer to get the items for."]
    pub OfferId: EOS_Ecom_CatalogOfferId,
    #[doc = " The index of the item to get."]
    pub ItemIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyOfferItemByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyOfferItemByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyOfferItemByIndexOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyOfferItemByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions),
            "::",
            stringify!(OfferId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferItemByIndexOptions),
            "::",
            stringify!(ItemIndex)
        )
    );
}
pub type EOS_Ecom_CopyOfferItemByIndexOptions = _tagEOS_Ecom_CopyOfferItemByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyItemByIdOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYITEMBYID_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the item to get."]
    pub ItemId: EOS_Ecom_CatalogItemId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyItemByIdOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyItemByIdOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyItemByIdOptions>(),
        24usize,
        concat!("Size of: ", stringify!(_tagEOS_Ecom_CopyItemByIdOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyItemByIdOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyItemByIdOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemByIdOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemByIdOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemByIdOptions),
            "::",
            stringify!(ItemId)
        )
    );
}
pub type EOS_Ecom_CopyItemByIdOptions = _tagEOS_Ecom_CopyItemByIdOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetOfferImageInfoCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETOFFERIMAGEINFOCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offer image is being accessed."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the offer to get the images for."]
    pub OfferId: EOS_Ecom_CatalogOfferId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetOfferImageInfoCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetOfferImageInfoCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetOfferImageInfoCountOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetOfferImageInfoCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetOfferImageInfoCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetOfferImageInfoCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferImageInfoCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferImageInfoCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetOfferImageInfoCountOptions),
            "::",
            stringify!(OfferId)
        )
    );
}
pub type EOS_Ecom_GetOfferImageInfoCountOptions = _tagEOS_Ecom_GetOfferImageInfoCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyOfferImageInfoByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYOFFERIMAGEINFOBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose offer image is being copied."]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the offer to get the images for."]
    pub OfferId: EOS_Ecom_CatalogOfferId,
    #[doc = " The index of the image to get."]
    pub ImageInfoIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyOfferImageInfoByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OfferId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions),
            "::",
            stringify!(OfferId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ImageInfoIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyOfferImageInfoByIndexOptions),
            "::",
            stringify!(ImageInfoIndex)
        )
    );
}
pub type EOS_Ecom_CopyOfferImageInfoByIndexOptions = _tagEOS_Ecom_CopyOfferImageInfoByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetItemImageInfoCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETITEMIMAGEINFOCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item image is being accessed"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the item to get the images for."]
    pub ItemId: EOS_Ecom_CatalogItemId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetItemImageInfoCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetItemImageInfoCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetItemImageInfoCountOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetItemImageInfoCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetItemImageInfoCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetItemImageInfoCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemImageInfoCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemImageInfoCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemImageInfoCountOptions),
            "::",
            stringify!(ItemId)
        )
    );
}
pub type EOS_Ecom_GetItemImageInfoCountOptions = _tagEOS_Ecom_GetItemImageInfoCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyItemImageInfoByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYITEMIMAGEINFOBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item image is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the item to get the images for."]
    pub ItemId: EOS_Ecom_CatalogItemId,
    #[doc = " The index of the image to get."]
    pub ImageInfoIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyItemImageInfoByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyItemImageInfoByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyItemImageInfoByIndexOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyItemImageInfoByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions),
            "::",
            stringify!(ItemId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ImageInfoIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemImageInfoByIndexOptions),
            "::",
            stringify!(ImageInfoIndex)
        )
    );
}
pub type EOS_Ecom_CopyItemImageInfoByIndexOptions = _tagEOS_Ecom_CopyItemImageInfoByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetItemReleaseCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETITEMRELEASECOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item release is being accessed"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the item to get the releases for."]
    pub ItemId: EOS_Ecom_CatalogItemId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetItemReleaseCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetItemReleaseCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetItemReleaseCountOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetItemReleaseCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetItemReleaseCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetItemReleaseCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemReleaseCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemReleaseCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetItemReleaseCountOptions),
            "::",
            stringify!(ItemId)
        )
    );
}
pub type EOS_Ecom_GetItemReleaseCountOptions = _tagEOS_Ecom_GetItemReleaseCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyItemReleaseByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYITEMRELEASEBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose item release is being copied"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the item to get the releases for."]
    pub ItemId: EOS_Ecom_CatalogItemId,
    #[doc = " The index of the release to get."]
    pub ReleaseIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyItemReleaseByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyItemReleaseByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyItemReleaseByIndexOptions>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyItemReleaseByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions),
            "::",
            stringify!(ItemId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyItemReleaseByIndexOptions),
            "::",
            stringify!(ReleaseIndex)
        )
    );
}
pub type EOS_Ecom_CopyItemReleaseByIndexOptions = _tagEOS_Ecom_CopyItemReleaseByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_GetTransactionCountOptions {
    #[doc = " API Version: Set this to EOS_ECOM_GETTRANSACTIONCOUNT_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user whose transaction count to get"]
    pub LocalUserId: EOS_EpicAccountId,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_GetTransactionCountOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_GetTransactionCountOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_GetTransactionCountOptions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_GetTransactionCountOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_GetTransactionCountOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_GetTransactionCountOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetTransactionCountOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_GetTransactionCountOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
}
pub type EOS_Ecom_GetTransactionCountOptions = _tagEOS_Ecom_GetTransactionCountOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyTransactionByIndexOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYTRANSACTIONBYINDEX_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user who is associated with the transaction"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The index of the transaction to get"]
    pub TransactionIndex: u32,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyTransactionByIndexOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyTransactionByIndexOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyTransactionByIndexOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIndexOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyTransactionByIndexOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIndexOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIndexOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIndexOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TransactionIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIndexOptions),
            "::",
            stringify!(TransactionIndex)
        )
    );
}
pub type EOS_Ecom_CopyTransactionByIndexOptions = _tagEOS_Ecom_CopyTransactionByIndexOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tagEOS_Ecom_CopyTransactionByIdOptions {
    #[doc = " API Version: Set this to EOS_ECOM_COPYTRANSACTIONBYID_API_LATEST."]
    pub ApiVersion: i32,
    #[doc = " The Epic Account ID of the local user who is associated with the transaction"]
    pub LocalUserId: EOS_EpicAccountId,
    #[doc = " The ID of the transaction to get"]
    pub TransactionId: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__tagEOS_Ecom_CopyTransactionByIdOptions() {
    const UNINIT: ::std::mem::MaybeUninit<_tagEOS_Ecom_CopyTransactionByIdOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_tagEOS_Ecom_CopyTransactionByIdOptions>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIdOptions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_tagEOS_Ecom_CopyTransactionByIdOptions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIdOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIdOptions),
            "::",
            stringify!(ApiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LocalUserId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_tagEOS_Ecom_CopyTransactionByIdOptions),
            "::",
            stringify!(LocalUserId)
        )
    );
